<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  
  <title><![CDATA[木子的博客]]></title>
  <subtitle><![CDATA[惆怅东栏一株雪  人生看得几清明]]></subtitle>
  <link href="/atom.xml" rel="self"/>
  <link href="//"/>
  <updated>2016-03-04T03:01:34.000Z</updated>
  <id>//</id>
  
  <author>
    <name><![CDATA[木子]]></name>
    
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title><![CDATA[I'm Back]]></title>
    <link href="/2016/03/04/I-m-Back/"/>
    <id>/2016/03/04/I-m-Back/</id>
    <published>2016-03-04T03:01:34.000Z</published>
    <updated>2016-03-04T03:01:34.000Z</updated>
    <content type="html"></content>
    <summary type="html">
    
    </summary>
    
  </entry>
  
  <entry>
    <title><![CDATA[JSONKit解析Unicode字符u0000内容出错]]></title>
    <link href="/2015/09/15/JSONKit%E8%A7%A3%E6%9E%90Unicode%E5%AD%97%E7%AC%A6u0000%E5%86%85%E5%AE%B9%E5%87%BA%E9%94%99/"/>
    <id>/2015/09/15/JSONKit解析Unicode字符u0000内容出错/</id>
    <published>2015-09-15T08:49:57.000Z</published>
    <updated>2015-09-15T08:51:59.000Z</updated>
    <content type="html"><![CDATA[<p>&#x4ECA;&#x5929;&#x9047;&#x5230;jsonkit&#x89E3;&#x6790;\0000&#x51FA;&#x9519;&#x7684;&#x95EE;&#x9898;</p>
]]></content>
    <summary type="html">
    <![CDATA[<p>&#x4ECA;&#x5929;&#x9047;&#x5230;jsonkit&#x89E3;&#x6790;\0000&#x51FA;&#x9519;&#x7684;&#x95EE;&#x9898;</p>
]]>
    </summary>
    
      <category term="experience" scheme="/tags/experience/"/>
    
  </entry>
  
  <entry>
    <title><![CDATA[CalculateSizeWarning]]></title>
    <link href="/2015/09/01/CalculateSizeWarning/"/>
    <id>/2015/09/01/CalculateSizeWarning/</id>
    <published>2015-09-01T14:04:18.000Z</published>
    <updated>2016-03-04T02:55:56.000Z</updated>
    <content type="html"><![CDATA[<p>&#x5F53;&#x5728;Cell&#x4E2D;&#x8BA1;&#x7B97;&#x6587;&#x5B57;&#x6240;&#x5360;&#x7684;size&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x7ED9;&#x5B9A;&#x5177;&#x4F53;&#x7684;size&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x7ED9;&#x4E0E;label&#x7684;frame&#xFF0C;&#x56E0;&#x4E3A;label&#x7684;frame&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x6839;&#x636E;&#x5C4F;&#x5E55;&#x7684;&#x5BBD;&#x5EA6;&#x800C;&#x8FDB;&#x884C;&#x4F38;&#x7F29;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x83B7;&#x53D6;frame&#x503C;&#x4E4B;&#x540E;</p>
]]></content>
    <summary type="html">
    <![CDATA[<p>&#x5F53;&#x5728;Cell&#x4E2D;&#x8BA1;&#x7B97;&#x6587;&#x5B57;&#x6240;&#x5360;&#x7684;size&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&]]>
    </summary>
    
  </entry>
  
  <entry>
    <title><![CDATA[FFMpeg]]></title>
    <link href="/2015/08/10/FFMpeg/"/>
    <id>/2015/08/10/FFMpeg/</id>
    <published>2015-08-10T06:29:39.000Z</published>
    <updated>2015-08-10T06:30:52.000Z</updated>
    <content type="html"><![CDATA[<ol>
<li><p>&#x4EA4;&#x53C9;&#x7F16;&#x8BD1;<br>a. &#x5728;FFMpeg&#x5B98;&#x7F51;&#x4E0B;&#x8F7D;&#x6E90;&#x7801;<br>b. &#x7F16;&#x8BD1;&#x9009;&#x9879;&#x53C2;&#x8003;&#x8FD9;&#x4E24;&#x4E2A;&#x535A;&#x5BA2;<br> <a href="http://www.cnblogs.com/zzugyl/p/3741698.html" target="_blank" rel="external">http://www.cnblogs.com/zzugyl/p/3741698.html</a><br> <a href="http://blog.sina.com.cn/s/blog_6dce99b10101lerq.html" target="_blank" rel="external">http://blog.sina.com.cn/s/blog_6dce99b10101lerq.html</a></p>
</li>
<li><p>&#x89E3;&#x7801;&#x6D41;&#x7A0B;<br> <a href="http://blog.csdn.net/ownwell/article/details/8113980" target="_blank" rel="external">http://blog.csdn.net/ownwell/article/details/8113980</a></p>
</li>
<li><p>OpenGLES&#x6E32;&#x67D3;YUV420P&#x4EE3;&#x7801;<br> <a href="http://www.cocoachina.com/bbs/read.php?tid-100908-keyword-yuv.html" target="_blank" rel="external">http://www.cocoachina.com/bbs/read.php?tid-100908-keyword-yuv.html</a></p>
</li>
</ol>
<p>&#x697C;&#x4E3B;&#x5C31;&#x662F;&#x9760;&#x7740;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5B8C;&#x6210;&#x89E3;&#x7801;&#x64AD;&#x653E;&#x7684;&#xFF0C;&#x795D;&#x505A;&#x76D1;&#x63A7;&#x89C6;&#x9891;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#x597D;&#x8FD0;&#xFF01;</p>
]]></content>
    <summary type="html">
    <![CDATA[<ol>
<li><p>&#x4EA4;&#x53C9;&#x7F16;&#x8BD1;<br>a. &#x5728;FFMpeg&#x5B98;&#x7F51;&#x4E0B;&#x8F7D;&#x6E90;&#x7801;<br>b. &#x7F16;&#x8BD1;&#x9]]>
    </summary>
    
      <category term="FFMpeg" scheme="/tags/FFMpeg/"/>
    
      <category term="video" scheme="/tags/video/"/>
    
  </entry>
  
  <entry>
    <title><![CDATA[【转】把时间当朋友]]></title>
    <link href="/2015/08/06/%E6%8A%8A%E6%97%B6%E9%97%B4%E5%BD%93%E6%9C%8B%E5%8F%8B/"/>
    <id>/2015/08/06/把时间当朋友/</id>
    <published>2015-08-06T06:23:38.000Z</published>
    <updated>2015-08-06T06:34:45.000Z</updated>
    <content type="html"><![CDATA[<h2 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h2><p>&#x4EBA;&#x751F;&#x662F;&#x9A6C;&#x62C9;&#x677E;&#xFF0C;&#x80DC;&#x8005;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x8DD1;&#x5F97;&#x6700;&#x5FEB;&#x7684;&#x3002;</p>
<p>&#x4EE5;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x4F53;&#x4F1A;&#xFF0C;&#x6211;&#x975E;&#x5E38;&#x9F13;&#x52B1;&#x6BCF;&#x4E2A;&#x5E74;&#x8F7B;&#x4EBA;&#x80FD;&#x82B1;&#x4E0A;&#x51E0;&#x5E74;&#x65F6;&#x95F4;&#x5230;&#x56FD;&#x5916;&#x8D70;&#x4E00;&#x8D70;&#xFF0C;&#x5B66;&#x4E00;&#x5B66;&#x3002;&#x6559;&#x80B2;&#x7684;&#x6839;&#x672C;&#x5176;&#x5B9E;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x201C;&#x89C1;&#x591A;&#x8BC6;&#x5E7F;&#x201D;&#x3002;&#x7136;&#x540E;&#x518D;&#x7528;5&#x5230;10&#x5E74;&#x65F6;&#x95F4;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x751F;&#x65B9;&#x5411;&#xFF0C;&#x4E3A;&#x4E4B;&#x594B;&#x6597;&#xFF0C;&#x4E3A;&#x4E4B;&#x575A;&#x6301;&#xFF0C;&#x4E0D;&#x77E5;&#x505C;&#x6B47;&#x5730;&#x52AA;&#x529B;&#x4E0A;10&#x5E74;20&#x5E74;&#x3002;&#x6709;&#x4E9B;&#x6210;&#x529F;&#x9760;&#x8FD0;&#x6C14;&#xFF0C;&#x53EF;&#x662F;&#x6301;&#x7EED;&#x7684;&#x6210;&#x529F;&#x5374;&#x4E0E;&#x8FD0;&#x6C14;&#x65E0;&#x5173;&#x3002;</p>
<h2 id="&#x6240;&#x6709;&#x4EBA;&#x7684;&#x56F0;&#x5883;">&#x6240;&#x6709;&#x4EBA;&#x7684;&#x56F0;&#x5883;</h2><h3 id="&#x63D0;&#x95EE;&#x548C;&#x56DE;&#x7B54;">&#x63D0;&#x95EE;&#x548C;&#x56DE;&#x7B54;</h3><p>&#x82CF;&#x683C;&#x62C9;&#x5E95;&#x63D0;&#x793A;&#x6240;&#x8C13;&#x7684;&#x601D;&#x8003;&#x8FC7;&#x7A0B;&#x4E0D;&#x8FC7;&#x662F;&#x201C;&#x63D0;&#x95EE;&#x548C;&#x56DE;&#x7B54;&#x201D;&#x3002;</p>
<p>&#x6211;&#x4E00;&#x76F4;&#x76F8;&#x4FE1;&#xFF0C;&#x6559;&#x662F;&#x6700;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5728;&#x4E0D;&#x505C;&#x5730;&#x4E3A;&#x5B66;&#x751F;&#x89E3;&#x91CA;&#x7591;&#x95EE;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x5B66;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x66F4;&#x591A;&#xFF0C;&#x800C;&#x66F4;&#x591A;&#x7684;&#x7A0B;&#x5E8F;&#x8D85;&#x4E4E;&#x60F3;&#x8C61;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x5FC3;&#x667A;&#x7684;&#x529B;&#x91CF;">&#x5FC3;&#x667A;&#x7684;&#x529B;&#x91CF;</h2><h3 id="&#x559C;&#x6B22;&#x4E0E;&#x5174;&#x8DA3;&#x65B9;&#x6CD5;&#x6210;&#x529F;&#x5B66;&#x539F;&#x7406;&#x884C;&#x52A8;&#x7231;&#x81EA;&#x5DF1;">&#x559C;&#x6B22;&#x4E0E;&#x5174;&#x8DA3;&#xFF0C;&#x65B9;&#x6CD5;&#xFF0C;&#x6210;&#x529F;&#x5B66;&#x539F;&#x7406;&#xFF0C;&#x884C;&#x52A8;&#xFF0C;&#x7231;&#x81EA;&#x5DF1;</h3><p>&#x7ECF;&#x5E38;&#x6709;&#x5B66;&#x751F;&#x5411;&#x6211;&#x8868;&#x793A;&#x5979;&#x5BF9;&#x76EE;&#x524D;&#x7684;&#x4E13;&#x4E1A;&#x6CA1;&#x5174;&#x8DA3;&#xFF0C;&#x5979;&#x771F;&#x6B63;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x662F;&#x67D0;&#x67D0;&#x4E13;&#x4E1A;&#x3002;&#x2014;&#x2014;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x4E0D;&#x5FEB;&#x4E50;&#x3002;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#xFF08;&#x89C9;&#x5F97;&#xFF09;&#x81EA;&#x5DF1;&#x6B63;&#x5728;&#x505A;&#x81EA;&#x5DF1;&#x4E0D;&#x559C;&#x6B22;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x771F;&#x7684;&#x662F;&#x4ED6;&#x4EEC;&#x4EE5;&#x4E3A;&#x7684;&#x90A3;&#x6837;&#x4E48;&#xFF1F;&#x4E0D;&#x5BA2;&#x6C14;&#x5730;&#x8BF4;&#xFF0C;99%&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x5E76;&#x4E0D;&#x662F;&#x5BF9;&#x6B63;&#x5728;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x6CA1;&#x6709;&#x5174;&#x8DA3;&#xFF0C;&#x800C;&#x662F;&#x6CA1;&#x80FD;&#x529B;&#x628A;&#x76EE;&#x524D;&#x6B63;&#x5728;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#x3002;&#x6700;&#x7EC8;&#x6CA1;&#x6709;&#x4EBA;&#x559C;&#x6B22;&#x81EA;&#x5DF1;&#x505A;&#x4E0D;&#x597D;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x5F80;&#x5F80;&#x5E76;&#x4E0D;&#x662F;&#x6709;&#x5174;&#x8DA3;&#x624D;&#x80FD;&#x505A;&#x597D;&#xFF0C;&#x800C;&#x662F;&#x505A;&#x597D;&#x4E86;&#x624D;&#x6709;&#x5174;&#x8DA3;&#x3002;</p>
<p>&#x65B9;&#x6CD5;&#x56FA;&#x7136;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x662F;&#x6BD4;&#x8D77;&#x201C;&#x7528;&#x529F;&#x201D;&#x6765;&#x8BF4;&#xFF0C;&#x65B9;&#x6CD5;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#x3002;</p>
<p>&#x6240;&#x6709;&#x5B66;&#x4E60;&#x4E0A;&#x7684;&#x6210;&#x529F;&#xFF0C;&#x90FD;&#x53EA;&#x9760;&#x4E24;&#x4EF6;&#x4E8B;&#xFF1A;&#x7B56;&#x7565;&#x548C;&#x575A;&#x6301;&#xFF0C;&#x800C;&#x575A;&#x6301;&#x672C;&#x8EAB;&#x5C31;&#x5E94;&#x8BE5;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x575A;&#x6301;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x91CD;&#x590D;&#xFF1B;&#x800C;&#x91CD;&#x590D;&#xFF0C;&#x8BF4;&#x5230;&#x5E95;&#x5C31;&#x662F;&#x65F6;&#x95F4;&#x7684;&#x6295;&#x5165;&#xFF0C;&#x6211;&#x662F;&#x8BF4;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x6295;&#x5165;&#x3002;</p>
<p>&#x4E0E;&#x5176;&#x4E0D;&#x505C;&#x5730;&#x627E;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD8;&#x4E0D;&#x5982;&#x9A6C;&#x4E0A;&#x5F00;&#x59CB;&#x884C;&#x52A8;&#xFF0C;&#x7701;&#x5F97;&#x865A;&#x5EA6;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x3002;// &#x9A6C;&#x4E0A;&#x5F00;&#x59CB;&#x884C;&#x52A8;&#xFF0C;&#x5728;&#x884C;&#x52A8;&#x4E2D;&#x8C03;&#x6574;&#x3001;&#x6539;&#x5584;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x53EA;&#x6709;&#x62E5;&#x6709;&#x4E86;&#x65E0;&#x4E0E;&#x4F26;&#x6BD4;&#x7684;&#x6253;&#x5B57;&#x901F;&#x5EA6;&#x624D;&#x77E5;&#x9053;&#x6253;&#x5B57;&#x5FEB;&#x7A7A;&#x95F4;&#x6709;&#x591A;&#x5927;&#x7684;&#x597D;&#x5904;&#x3002;&#x6211;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x6211;&#x4E0D;&#x518D;&#x8BA8;&#x538C;&#x5728;&#x8BFB;&#x4E66;&#x7684;&#x65F6;&#x5019;&#x505A;&#x7B14;&#x8BB0;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x952E;&#x76D8;&#x4E0A;&#x6572;&#x591A;&#x5C11;&#x5B57;&#x76F8;&#x5BF9;&#x4E8E;&#x7528;&#x7EB8;&#x7B14;&#x6765;&#x8BF4;&#x90FD;&#x8981;&#x8F7B;&#x677E;&#x592A;&#x591A;&#x3002;&#x6211;&#x5F00;&#x59CB;&#x5927;&#x6BB5;&#x5730;&#x8BB0;&#x5F55;&#x611F;&#x60F3;&#x751A;&#x81F3;&#x6709;&#x65F6;&#x5019;&#x5E72;&#x8106;&#x5927;&#x6BB5;&#x6458;&#x6284;&#x539F;&#x6587;&#x3002;// &#x53EA;&#x6709;&#x5230;&#x8FBE;&#x4E86;&#x5C71;&#x9876;&#xFF0C;&#x4F60;&#x624D;&#x4F1A;&#x53D1;&#x73B0;&#x90A3;&#x91CC;&#x7684;&#x98CE;&#x666F;&#x662F;&#x591A;&#x4E48;&#x597D;&#x3002;&#x800C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x7531;&#x4E8E;&#x61D2;&#x60F0;&#xFF0C;&#x5F80;&#x5F80;&#x5728;&#x5C71;&#x811A;&#x4E0B;&#x5C31;&#x544A;&#x8BC9;&#x81EA;&#x5DF1;&#xFF0C;&#x5C71;&#x4E0A;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x770B;&#x7684;&#x5462;&#xFF0C;&#x6CA1;&#x610F;&#x601D;&#x3002;&#x4ECE;&#x800C;&#x653E;&#x5F03;&#x4E86;&#x722C;&#x5C71;&#x7684;&#x6253;&#x7B97;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x8981;&#x6BD4;&#x53D1;&#x73B0;&#x3001;&#x57F9;&#x517B;&#x3001;&#x5475;&#x62A4;&#x3001;&#x8C03;&#x6574;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x667A;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;</p>
<h2 id="&#x5F00;&#x542F;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x667A;">&#x5F00;&#x542F;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x667A;</h2><h3 id="&#x5FC3;&#x667A;&#x5B9A;&#x4E49;&#x8BA4;&#x77E5;&#x80CC;&#x79BB;&#x5927;&#x8111;&#x4E0E;&#x63A7;&#x5236;&#x5FC3;&#x667A;&#x8F6C;&#x79FB;&#x5C34;&#x5C2C;&#x5EF6;&#x8FDF;&#x6B32;&#x671B;&#x8010;&#x5FC3;">&#x5FC3;&#x667A;&#x5B9A;&#x4E49;&#xFF0C;&#x8BA4;&#x77E5;&#x80CC;&#x79BB;&#xFF0C;&#x5927;&#x8111;&#x4E0E;&#x63A7;&#x5236;&#xFF0C;&#x5FC3;&#x667A;&#x8F6C;&#x79FB;&#xFF0C;&#x5C34;&#x5C2C;&#xFF0C;&#x5EF6;&#x8FDF;&#x6B32;&#x671B;&#xFF0C;&#x8010;&#x5FC3;</h3><p>&#x6211;&#x6240;&#x8BF4;&#x7684;&#x201C;&#x5FC3;&#x667A;&#x201D;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x82F1;&#x6587;&#x5355;&#x8BCD;&#x662F;&#x201C;Mind&#x201D;&#x3002;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x201C;&#x5FC3;&#x667A;&#x201D;&#x6307;&#x7684;&#x662F;&#x4ED6;&#x5404;&#x9879;&#x601D;&#x7EF4;&#x80FD;&#x529B;&#x7684;&#x603B;&#x548C;&#xFF0C;&#x7528;&#x4EE5;&#x611F;&#x53D7;&#x3001;&#x89C2;&#x5BDF;&#x3001;&#x7406;&#x89E3;&#x3001;&#x5224;&#x65AD;&#x3001;&#x9009;&#x62E9;&#x3001;&#x8BB0;&#x5FC6;&#x3001;&#x60F3;&#x50CF;&#x3001;&#x5047;&#x8BBE;&#x3001;&#x63A8;&#x7406;&#xFF0C;&#x800C;&#x540E;&#x6307;&#x5BFC;&#x5176;&#x884C;&#x4E3A;&#x3002;&#x5728;&#x4F17;&#x591A;&#x5B9A;&#x4E49;&#x4E4B;&#x4E2D;&#xFF0C;&#x6211;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x4E54;&#x6CBB;&#xB7;&#x535A;&#x745E;&#x535A;&#x58EB;&#x7684;&#x5B9A;&#x4E49;&#xFF1A;&#x5FC3;&#x667A;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x80FD;&#x529B;&#xFF1A;a. &#x83B7;&#x5F97;&#x77E5;&#x8BC6;&#xFF1B;b. &#x5E94;&#x7528;&#x77E5;&#x8BC6;&#xFF1B;c. &#x62BD;&#x8C61;&#x63A8;&#x7406;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x601D;&#x8003;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#x548C;&#x601D;&#x8003;&#x7ED3;&#x679C;&#x662F;&#x5426;&#x786E;&#x5B9E;&#x662F;&#x5408;&#x7406;&#x7684;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#x548C;&#x601D;&#x8003;&#x7ED3;&#x679C;&#x3002;// &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53BB;&#x601D;&#x8003;&#x201C;&#x601D;&#x8003;&#x201D;&#x8FD9;&#x4E2A;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x5230;&#x81EA;&#x5DF1;&#x7ADF;&#x7136;&#x53EF;&#x4EE5;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x5927;&#x8111;&#x63A7;&#x5236;&#x81EA;&#x5DF1;&#x7684;&#x5927;&#x8111;&#x540E;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x7262;&#x7262;&#x8BB0;&#x4F4F;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#x5C31;&#x53EF;&#x4EE5;&#x4ECE;&#x8D77;&#x70B9;&#x4E0D;&#x65AD;&#x8FDB;&#x6B65;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#x662F;&#xFF1A;&#x8FD9;&#x4E16;&#x754C;&#x4E0A;&#x6709;&#x4E9B;&#x4E8B;&#x60C5;&#x6216;&#x9053;&#x7406;&#xFF0C;&#x5927;&#x62B5;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;4&#x79CD;&#x60C5;&#x51B5;&#xFF1A; 1. &#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4EE5;&#x4E3A;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF1B; 2. &#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x9519;&#x8BEF;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5374;&#x4EE5;&#x4E3A;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF1B; 3. &#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5374;&#x4EE5;&#x4E3A;&#x662F;&#x9519;&#x8BEF;&#x7684;&#xFF1B; 4. &#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x9519;&#x8BEF;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4EE5;&#x4E3A;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x3002; // &#x8FD9;&#x91CC;&#x7684;&#x201C;&#x5B9E;&#x9645;&#x4E0A;&#x6B63;&#x786E;&#x201D;&#x6216;&#x201C;&#x5B9E;&#x9645;&#x4E0A;&#x9519;&#x8BEF;&#x201D;&#x4E0D;&#x5E94;&#x8BE5;&#x88AB;&#x7406;&#x89E3;&#x4E3A;&#x201C;&#x7EDD;&#x5BF9;&#x7684;&#x6B63;&#x786E;&#x201D;&#x6216;&#x201C;&#x7EDD;&#x5BF9;&#x7684;&#x9519;&#x8BEF;&#x201D;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x4E8E;&#x5177;&#x4F53;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x7262;&#x7262;&#x8BB0;&#x4F4F;&#x201C;&#x6211;&#x4EEC;&#x7684;&#x8BA4;&#x77E5;&#x4E0D;&#x4EC5;&#x53EF;&#x80FD;&#x4E5F;&#x786E;&#x5B9E;&#x5F80;&#x5F80;&#x80CC;&#x79BB;&#x73B0;&#x5B9E;&#x201D;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#x672C;&#x8EAB;&#xFF0C;&#x5C31;&#x5DF2;&#x7ECF;&#x8DB3;&#x4EE5;&#x4FDD;&#x8BC1;&#x6211;&#x4EEC;&#x4E0D;&#x65AD;&#x8FDB;&#x6B65;&#x4E86;&#x2014;&#x2014;&#x6211;&#x4EEC;&#x56E0;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#x800C;&#x5DF2;&#x7ECF;&#x62E5;&#x6709;&#x4E86;&#x826F;&#x597D;&#x7684;&#x81EA;&#x7701;&#x673A;&#x5236;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x8981;&#x6323;&#x624E;&#x5F88;&#x4E45;&#x624D;&#x80FD;&#x771F;&#x6B63;&#x660E;&#x767D;&#x8FD9;&#x4E2A;&#x9053;&#x7406;&#xFF1A;&#x4F60;&#x7684;&#x5927;&#x8111;&#x5E76;&#x4E0D;&#x662F;&#x4F60;&#xFF0C;&#x4F60;&#x7684;&#x5927;&#x8111;&#x662F;&#xFF08;&#x5C5E;&#x4E8E;&#xFF09;&#x201C;&#x4F60;&#x7684;&#x201D;&#x5927;&#x8111;&#x3002;&#x5C3D;&#x7BA1;&#x4F60;&#x7528;&#x5B83;&#x601D;&#x8003;&#xFF0C;&#x597D;&#x50CF;&#x5B83;&#x5728;&#x6307;&#x5BFC;&#x4F60;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F60;&#x8981;&#x660E;&#x767D;&#x4F60;&#x4E0D;&#x5E94;&#x8BE5;&#x96B6;&#x5C5E;&#x4E8E;&#x4F60;&#x7684;&#x5927;&#x8111;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x662F;&#x4F60;&#x62E5;&#x6709;&#x4F60;&#x7684;&#x5927;&#x8111;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x4F60;&#x7684;&#x5927;&#x8111;&#x3002;</p>
<p>&#x4E0D;&#x518D;&#x8BA9;&#x81EA;&#x5DF1;&#x6210;&#x4E3A;&#x81EA;&#x5DF1;&#x5927;&#x8111;&#x7684;&#x5974;&#x96B6;&#xFF0C;&#x800C;&#x662F;&#x9009;&#x62E9;&#x7FFB;&#x8EAB;&#x505A;&#x4E3B;&#x4EBA;&#x3002;</p>
<p>&#x75DB;&#x82E6;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x7ADF;&#x7136;&#x80FD;&#x8FD0;&#x7528;&#x5FC3;&#x667A;&#x628A;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x6CE8;&#x610F;&#x529B;&#x8F6C;&#x79FB;&#x5230;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x4E0A;&#x53BB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x75DB;&#x82E6;&#x5C31;&#x4F1A;&#x51E0;&#x4E4E;&#x81EA;&#x52A8;&#x6D88;&#x5931;&#xFF0C;&#x5728;&#x4F60;&#x91CD;&#x65B0;&#x6CE8;&#x610F;&#x5B83;&#x4E4B;&#x524D;&#xFF0C;&#x5B83;&#x4E0D;&#x4F1A;&#x56DE;&#x6765;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8BF4;&#x8BB0;&#x5FC6;&#x672C;&#x8EAB;&#x662F;&#x8461;&#x8404;&#xFF0C;&#x90A3;&#x4E48;&#x56DE;&#x5FC6;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x53D1;&#x9175;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x52AA;&#x529B;&#x4F7F;&#x81EA;&#x5DF1;&#x7684;&#x5386;&#x53F2;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x6E05;&#x767D;&#x66F4;&#x52A0;&#x7F8E;&#x597D;&#x7684;&#x503E;&#x5411;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x4E0D;&#x81EA;&#x89C9;&#x5730;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x8BB0;&#x5FC6;&#x8FDB;&#x884C;&#x5404;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x4FEE;&#x8865;&#xFF0C;&#x751A;&#x81F3;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x7CBE;&#x52A0;&#x5DE5;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x4F1A;&#x89C9;&#x5F97;&#x5FC3;&#x6EE1;&#x610F;&#x8DB3;&#x3002;</p>
<p>&#x8BB0;&#x5F55;&#x5C34;&#x5C2C;&#x573A;&#x666F;&#xFF0C;&#x4E0D;&#x65AD;&#x63D0;&#x9192;&#x81EA;&#x5DF1;&#xFF0C;&#x9632;&#x6B62;&#x518D;&#x72AF;&#x3002;</p>
<p>&#x5728;&#x9762;&#x4E34;&#x5C34;&#x5C2C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C3D;&#x91CF;&#x5F31;&#x5316;&#x4F60;&#x7684;&#x75DB;&#x82E6;&#x3002;&#x63A7;&#x5236;&#x81EA;&#x5DF1;&#x7684;&#x60C5;&#x7EEA;&#xFF0C;&#x4E0D;&#x8981;&#x88AB;&#x4F60;&#x7684;&#x5927;&#x8111;&#x7684;&#x76F4;&#x63A5;&#x53CD;&#x5E94;&#x6240;&#x5DE6;&#x53F3;&#x3002;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x4F60;&#x6240;&#x9762;&#x4E34;&#x7684;&#x6240;&#x6709;&#x5C34;&#x5C2C;&#xFF0C;&#x6700;&#x7EC8;&#x80AF;&#x5B9A;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x539F;&#x56E0;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#x9020;&#x6210;&#x7684;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x627F;&#x8BA4;&#x201C;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x7684;&#x6B32;&#x671B;&#x9A6C;&#x4E0A;&#x83B7;&#x5F97;&#x6EE1;&#x8DB3;&#x201D;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x5929;&#x6027;&#x5C31;&#x597D;&#x529E;&#x4E86;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x5E73;&#x9759;&#x63A5;&#x53D7;&#x5E76;&#x4E14;&#x6B63;&#x786E;&#x8BA4;&#x8BC6;&#x81EA;&#x5DF1;&#x7684;&#x5929;&#x6027;&#x662F;&#x6539;&#x53D8;&#x5929;&#x6027;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x3002;&#x5C31;&#x7B97;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x5929;&#x6027;&#x96BE;&#x79FB;&#xFF0C;&#x65E0;&#x6CD5;&#x5F7B;&#x5E95;&#x6539;&#x53D8;&#xFF0C;&#x90A3;&#x4E48;&#x4E5F;&#x8D77;&#x7801;&#x8FD8;&#x53EF;&#x4EE5;&#x7A0D;&#x52A0;&#x63A7;&#x5236;&#xFF0C;&#x7565;&#x5FAE;&#x6539;&#x5584;&#x3002;&#x6CA1;&#x5FC5;&#x8981;&#x63A7;&#x5236;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x65B9;&#x9762;&#x9762;&#xFF0C;&#x8FD9;&#x4E0D;&#x53EA;&#x662F;&#x5F88;&#x96BE;&#x505A;&#x5230;&#xFF0C;&#x800C;&#x662F;&#x5E72;&#x8106;&#x4E0D;&#x53EF;&#x80FD;&#x505A;&#x5230;&#x3002;</p>
<p>&#x63A7;&#x5236;&#x8FD9;&#x79CD;&#x5929;&#x6027;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x4ED4;&#x7EC6;&#x5BA1;&#x89C6;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x5728;&#x54EA;&#x65B9;&#x9762;&#x8FD9;&#x79CD;&#x5929;&#x6027;&#x5C24;&#x4E3A;&#x5F3A;&#x70C8;&#xFF1F;&#x518D;&#x4E00;&#x6B21;&#x62FF;&#x51FA;&#x7EB8;&#x7B14;&#x7F57;&#x5217;&#x3002;&#x7ECF;&#x8FC7;&#x51E0;&#x5929;&#x751A;&#x81F3;&#x51E0;&#x4E2A;&#x6708;&#x7684;&#x957F;&#x671F;&#x53CD;&#x590D;&#x5BA1;&#x89C6;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x90A3;&#x4E2A;&#x5217;&#x8868;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x957F;&#x3002;&#x522B;&#x6015;&#xFF0C;&#x76F8;&#x4FE1;&#x6211;&#xFF0C;&#x8C01;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x2014;&#x2014;&#x81F3;&#x5C11;99.9%&#x7684;&#x4EBA;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;&#x7136;&#x540E;&#x4ECE;&#x5217;&#x8868;&#x4E2D;&#x6311;&#x51FA;&#x4E00;&#x4E2A;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF08;&#x5982;&#x679C;&#x4F60;&#x6709;&#x91CE;&#x5FC3;&#x7684;&#x8BDD;&#xFF0C;&#x518D;&#x6311;&#x51FA;&#x4E00;&#x4E2A;&#x4E5F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF09;&#xFF0C;&#x5199;&#x5728;&#x968F;&#x673A;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E0D;&#x505C;&#x5730;&#x63D0;&#x9192;&#x81EA;&#x5DF1;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x4E00;&#x5B9A;&#x8981;&#x63A7;&#x5236;&#x8FD9;&#x79CD;&#x5929;&#x6027;&#x3002;</p>
<p>&#x6211;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#xFF0C;&#x5728;&#x5DE5;&#x4F5C;&#x548C;&#x5B66;&#x4E60;&#x4E0A;&#x63A7;&#x5236;&#x8FD9;&#x79CD;&#x5929;&#x6027;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x80FD;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x63A7;&#x5236;&#x4F4F;&#x81EA;&#x5DF1;&#x7684;&#x5929;&#x6027;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x7A0D;&#x5FAE;&#x653E;&#x7EB5;&#x4E00;&#x4E0B;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x76F8;&#x4FE1;&#x6211;&#xFF0C;&#x5076;&#x5C14;&#x5927;&#x9189;&#x4E00;&#x573A;&#x6CA1;&#x4EC0;&#x4E48;&#x4E0D;&#x597D;&#x3002;&#x5076;&#x5C14;&#x8FDE;&#x7EED;&#x6253;&#x4E0A;&#x4E24;&#x5929;&#x4E24;&#x591C;&#x7684;&#x724C;&#x4E0D;&#x4EC5;&#x6709;&#x52A9;&#x4E8E;&#x8EAB;&#x5FC3;&#x5065;&#x5EB7;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x597D;&#x7684;&#x793E;&#x4EA4;&#x6D3B;&#x52A8;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x5DE5;&#x4F5C;&#x548C;&#x5B66;&#x4E60;&#x4E0A;&#xFF0C;&#x575A;&#x51B3;&#x4E0D;&#x8981;&#x653E;&#x7EB5;&#x3002;&#x5DE5;&#x4F5C;&#x548C;&#x5B66;&#x4E60;&#x90FD;&#x662F;&#x8270;&#x82E6;&#x7684;&#xFF0C;&#x8DEF;&#x7A0B;&#x90FD;&#x662F;&#x6F2B;&#x957F;&#x7684;&#xFF0C;&#x6210;&#x679C;&#x90FD;&#x4E0D;&#x53EF;&#x80FD;&#x4E00;&#x8E74;&#x800C;&#x5C31;&#x3002;&#x7ECF;&#x9A8C;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x5728;&#x5DE5;&#x4F5C;&#x548C;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F53;&#x7136;&#x9700;&#x8981;&#x6280;&#x5DE7;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x573A;&#x89C1;&#x6548;&#x7684;&#x6280;&#x5DE7;&#x5C11;&#x4E4B;&#x53C8;&#x5C11;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5C31;&#x7B97;&#x627E;&#x5230;&#x4E86;&#xFF0C;&#x4E5F;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E4B;&#x4E00;&#xFF1A;a. &#x5BFB;&#x627E;&#x8FD9;&#x4E2A;&#x6280;&#x5DE7;&#x5DF2;&#x7ECF;&#x82B1;&#x8D39;&#x4E86;&#x592A;&#x591A;&#x7684;&#x65F6;&#x95F4;&#xFF1B;b. &#x8FD9;&#x4E2A;&#x6280;&#x5DE7;&#x53EF;&#x80FD;&#x6709;&#x540E;&#x9057;&#x75C7;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x73B0;&#x5728;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x201C;&#x63A8;&#x8FDF;&#x6EE1;&#x8DB3;&#x611F;&#x201D;&#x662F;&#x5FC3;&#x667A;&#x6210;&#x719F;&#x7684;&#x4EBA;&#x5FC5;&#x5907;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4E5F;&#x662F;&#x9700;&#x8981;&#x6323;&#x624E;&#x548C;&#x953B;&#x70BC;&#x624D;&#x53EF;&#x4EE5;&#x4E60;&#x5F97;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x6B63;&#x5728;&#x62E5;&#x6709;&#x8010;&#x5FC3;&#xFF0C;&#x751A;&#x81F3;&#x60CA;&#x4EBA;&#x8010;&#x5FC3;&#x7684;&#x4F60;&#xFF0C;&#x751F;&#x6D3B;&#x5C31;&#x4F1A;&#x4ECE;&#x6B64;&#x53D1;&#x751F;&#x5929;&#x7FFB;&#x5730;&#x8986;&#x7684;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x8010;&#x5FC3;&#x6709;&#x7740;&#x795E;&#x5947;&#x7684;&#x529B;&#x91CF;&#x3002;&#x5F53;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5728;&#x62D6;&#x5EF6;&#xFF0C;&#x6700;&#x540E;&#x53C8;&#x624B;&#x5FD9;&#x811A;&#x4E71;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x7684;&#x751F;&#x6D3B;&#x5374;&#x975E;&#x5E38;&#x4ECE;&#x5BB9;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x77E5;&#x9053;&#x4F60;&#x4ECA;&#x5929;&#x7684;&#x6240;&#x6709;&#x8F7B;&#x677E;&#x5B89;&#x9038;&#xFF0C;&#x90FD;&#x53EF;&#x80FD;&#x662F;&#x672A;&#x6765;&#x7684;&#x6210;&#x672C;&#xFF1B;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x65E9;&#x5C31;&#x628A;&#x4E00;&#x4E9B;&#x8F7B;&#x677E;&#x5B89;&#x9038;&#x5B89;&#x6392;&#x5230;&#x672A;&#x6765;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x6BB5;&#xFF0C;&#x800C;&#x5FC3;&#x5E73;&#x6C14;&#x548C;&#x5730;&#x6BCF;&#x5929;&#x5B8C;&#x6210;&#x76F8;&#x5E94;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x4F60;&#x4E0D;&#x4EC5;&#x4ECE;&#x5BB9;&#xFF0C;&#x800C;&#x4E14;&#x5FEB;&#x4E50;&#x3002;&#x4F60;&#x4F1A;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x5B88;&#x65F6;&#x7684;&#x4EBA;&#xFF0C;&#x4E00;&#x4E2A;&#x751F;&#x6D3B;&#x6709;&#x89C4;&#x5F8B;&#x7684;&#x4EBA;&#xFF0C;&#x4E00;&#x4E2A;&#x8EAB;&#x8FB9;&#x7684;&#x670B;&#x53CB;&#x90FD;&#x4F9D;&#x8D56;&#x7684;&#x4EBA;&#x3002;&#x4F60;&#x4F1A;&#x5B9A;&#x65F6;&#x53BB;&#x5065;&#x8EAB;&#x623F;&#xFF0C;&#x4ECE;&#x4E0D;&#x4E3A;&#x81EA;&#x5DF1;&#x7626;&#x5F97;&#x592A;&#x6162;&#x800C;&#x70E6;&#x607C;&#x7684;&#x540C;&#x65F6;&#x7ADF;&#x7136;&#x7528;&#x8282;&#x98DF;&#x751A;&#x81F3;&#x541E;&#x98DF;&#x6CFB;&#x836F;&#x7684;&#x65B9;&#x6CD5;&#x53BB;&#x51CF;&#x80A5;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x5728;&#x90A3;&#x4E9B;&#x4EBA;&#x56E0;&#x4E3A;&#x65E0;&#x5948;&#x800C;&#x62B1;&#x6028;&#x6216;&#x9762;&#x4E34;&#x7EDD;&#x671B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x65E9;&#x5DF2;&#x7ECF;&#x662F;&#x6301;&#x7EED;&#x953B;&#x70BC;&#x4E86;&#x8BB8;&#x591A;&#x5E74;&#x7684;&#x5065;&#x5EB7;&#x7684;&#x4EBA;&#x3002;</p>
<h2 id="&#x901A;&#x8FC7;&#x7BA1;&#x7406;&#x81EA;&#x5DF1;&#x4E0E;&#x65F6;&#x95F4;&#x505A;&#x670B;&#x53CB;">&#x901A;&#x8FC7;&#x7BA1;&#x7406;&#x81EA;&#x5DF1;&#x4E0E;&#x65F6;&#x95F4;&#x505A;&#x670B;&#x53CB;</h2><h3 id="&#x81EA;&#x5F8B;&#x9057;&#x5FD8;&#x4FDD;&#x62A4;&#x61D2;&#x60F0;&#x968F;&#x624B;&#x8D34;&#x4E60;&#x60EF;&#x65F6;&#x95F4;&#x4E8B;&#x4EF6;&#x91CD;&#x8981;&#x7A0B;&#x5EA6;&#x8BA1;&#x5212;&#x8BD5;&#x9519;">&#x81EA;&#x5F8B;&#xFF0C;&#x9057;&#x5FD8;&#x4FDD;&#x62A4;&#xFF0C;&#x61D2;&#x60F0;&#xFF0C;&#x968F;&#x624B;&#x8D34;&#xFF0C;&#x4E60;&#x60EF;&#xFF0C;&#x65F6;&#x95F4;&#x4E8B;&#x4EF6;&#xFF0C;&#x91CD;&#x8981;&#x7A0B;&#x5EA6;&#xFF0C;&#x8BA1;&#x5212;&#xFF0C;&#x8BD5;&#x9519;</h3><p>&#x201C;&#x5FC3;&#x667A;&#x5F00;&#x542F;&#x201D;&#x7684;&#x8D77;&#x70B9;&#x662F;&#x201C;&#x610F;&#x8BC6;&#x5230;&#x53EF;&#x4EE5;&#x81EA;&#x5F8B;&#x201D;&#xFF0C;&#x800C;&#x5FC3;&#x667A;&#x53D1;&#x5C55;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x514B;&#x670D;&#x61D2;&#x60F0;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5E38;&#x542C;&#x8BF4;&#xFF0C;&#x201C;&#x6700;&#x53EF;&#x6015;&#x7684;&#x654C;&#x4EBA;&#x5C31;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#x201D;&#xFF0C;&#x8FD9;&#x53E5;&#x8BDD;&#x5982;&#x679C;&#x6709;&#x9053;&#x7406;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E2A;&#x201C;&#x6700;&#x53EF;&#x6015;&#x7684;&#x654C;&#x4EBA;&#x201D;&#x5B9E;&#x9645;&#x4E0A;&#x5E94;&#x8BE5;&#x6307;&#x7684;&#x662F;&#x201C;&#x4F60;&#x90A3;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x7684;&#x61D2;&#x60F0;&#x201D;&#x3002;</p>
<p>&#x201C;&#x4EBA;&#x6216;&#x591A;&#x6216;&#x5C11;&#x662F;&#x7ECF;&#x9A8C;&#x4E3B;&#x4E49;&#x7684;&#x52A8;&#x7269;&#x201D;&#x3002;&#x4E5F;&#x8BB8;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x4E0D;&#x5E78;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4ED6;&#x4E00;&#x751F;&#x4E2D;&#x6700;&#x591A;&#x7684;&#x7ECF;&#x9A8C;&#x662F;&#x201C;&#x534A;&#x9014;&#x800C;&#x5E9F;&#x201D;&#x2014;&#x2014;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x3001;&#x5404;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x201C;&#x534A;&#x9014;&#x800C;&#x5E9F;&#x201D;&#x3002;&#x6211;&#x4EEC;&#x4E00;&#x751F;&#x4E2D;&#x534A;&#x9014;&#x800C;&#x5E9F;&#x7684;&#x7ECF;&#x9A8C;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x4E43;&#x81F3;&#x4E8E;&#x60F3;&#x8981;&#x653E;&#x5F03;&#x201C;&#x534A;&#x9014;&#x800C;&#x5E9F;&#x201D;&#x8981;&#x6BD4;&#x201C;&#x575A;&#x6301;&#x5230;&#x5E95;&#x6700;&#x7EC8;&#x6210;&#x529F;&#x201D;&#x96BE;&#x592A;&#x591A;&#x4E86;&#x2014;&#x2014;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x8FDE;&#x4E00;&#x6B21;&#x201C;&#x575A;&#x6301;&#x5230;&#x5E95;&#x6700;&#x7EC8;&#x6210;&#x529F;&#x201D;&#x7684;&#x7ECF;&#x9A8C;&#x90FD;&#x6CA1;&#x6709;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x51B3;&#x5FC3;&#x6539;&#x53D8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x201C;&#x61D2;&#x60F0;&#x201D;&#x4FBF;&#x4F1A;&#x6307;&#x4F7F;&#x6211;&#x4EEC;&#x7684;&#x90A3;&#x4E2A;&#x201C;&#x5927;&#x8111;&#x7684;&#x81EA;&#x6211;&#x4FDD;&#x62A4;&#x529F;&#x80FD;&#x201D;&#x2014;&#x2014;&#x201C;&#x9057;&#x5FD8;&#x201D;&#x2014;&#x2014;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x505C;&#x6B62;&#x6539;&#x53D8;&#x3002;// &#x8BB8;&#x591A;&#x7684;&#x534A;&#x9014;&#x800C;&#x5E9F;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x5FD8;&#x4E86;&#x53BB;&#x575A;&#x6301;&#xFF1B;&#x201C;&#x5FD8;&#x4E86;&#x53BB;&#x575A;&#x6301;&#x201D;&#x5F80;&#x5F80;&#x662F;&#x4ECE;&#x67D0;&#x4E00;&#x6B21;&#x677E;&#x61C8;&#x5F00;&#x59CB;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x4E0B;&#x51B3;&#x5FC3;&#x575A;&#x6301;&#x6BCF;&#x5929;&#x5199;&#x65E5;&#x8BB0;&#xFF0C;&#x7ED3;&#x679C;&#x67D0;&#x4E00;&#x5929;&#x56E0;&#x4E3A;&#x6709;&#x4E8B;&#x5FD9;&#x5230;&#x5F88;&#x665A;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x81EA;&#x5DF1;&#x8BF4;&#xFF0C;&#x4ECA;&#x5929;&#x5C31;&#x7B97;&#x4E86;&#x5427;&#x3002;&#x7136;&#x540E;&#x4EE5;&#x540E;&#x5C31;&#x6E10;&#x6E10;&#x5730;&#x9057;&#x5FD8;&#x4E86;&#x8981;&#x6BCF;&#x5929;&#x575A;&#x6301;&#x5199;&#x65E5;&#x8BB0;&#x8FD9;&#x4EF6;&#x4E8B;&#x3002;&#x4E5F;&#x8BB8;&#x90A3;&#x4EE5;&#x540E;&#x51E0;&#x5929;&#x91CC;&#x8FD8;&#x4F1A;&#x7A00;&#x7A00;&#x62C9;&#x62C9;&#x5199;&#x51E0;&#x5929;&#xFF0C;&#x4F46;&#x8FC7;&#x4E0D;&#x4E86;&#x591A;&#x4E45;&#xFF0C;&#x5C31;&#x771F;&#x7684;&#x5C06;&#x8FD9;&#x4EF6;&#x4E8B;&#x5F7B;&#x5E95;&#x629B;&#x5F03;&#x4E86;&#x3002;&#x8981;&#x76F4;&#x5230;&#x5F88;&#x4E45;&#x540E;&#x624D;&#x60F3;&#x8D77;&#x201C;&#x54E6;&#xFF0C;&#x539F;&#x6765;&#x6211;&#x66FE;&#x7ECF;&#x662F;&#x60F3;&#x6BCF;&#x5929;&#x575A;&#x6301;&#x5199;&#x65E5;&#x8BB0;&#x7684;&#x201D;&#x3002;&#x8FD9;&#x4E0D;&#x662F;&#x7EDD;&#x5BF9;&#xFF0C;&#x5F53;&#x73B0;&#x5B9E;&#x5F80;&#x5F80;&#x5982;&#x6B64;&#x3002;&#x4E3A;&#x4E86;&#x4E0D;&#x8BA9;&#x81EA;&#x5DF1;&#x9057;&#x5FD8;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x7ECF;&#x5E38;&#x751A;&#x81F3;&#x662F;&#x6BCF;&#x5929;&#x90FD;&#x63D0;&#x9192;&#x81EA;&#x5DF1;&#xFF1B;&#x6B63;&#x5982;&#x4E3A;&#x4E86;&#x4E0D;&#x8BA9;&#x81EA;&#x5DF1;&#x6CC4;&#x6C14;&#x6BCF;&#x5929;&#x7ED9;&#x81EA;&#x5DF1;&#x6253;&#x6C14;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x4E0E;&#x61D2;&#x60F0;&#x6297;&#x4E89;&#x3001;&#x505C;&#x6B62;&#x9057;&#x5FD8;&#x3001;&#x575A;&#x6301;&#x6539;&#x53D8;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5C31;&#x662F;&#x7EB8;&#x7B14;&#x3002;&#xFF08;// &#x5F53;&#x7136;&#xFF0C;&#x751F;&#x6D3B;&#x5728;21&#x4E16;&#x7EAA;&#xFF0C;&#x8FD8;&#x5728;&#x5B66;&#x4F1A;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x8F6F;&#x4EF6;&#x548C;app&#x6765;&#x534F;&#x52A9;&#x4F60;&#x751F;&#x6D3B;&#x5F97;&#x66F4;&#x597D;&#x3002;&#xFF09;&#x90A3;&#x5929;&#xFF0C;&#x6211;&#x770B;&#x7740;&#x90A3;&#x4E2A;&#x9ED1;&#x8272;&#x7CBE;&#x88C5;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#xFF0C;&#x76EF;&#x7740;&#x4E00;&#x5E74;&#x591A;&#x4EE5;&#x524D;&#x6700;&#x540E;&#x8BB0;&#x5F55;&#x7684;&#x65E5;&#x671F;&#xFF0C;&#x4E0D;&#x7981;&#x53D1;&#x5446;&#xFF1A;&#x6211;&#x5C31;&#x662F;&#x77E5;&#x9053;&#x201C;&#x4E0E;&#x61D2;&#x60F0;&#x6297;&#x4E89;&#x3001;&#x505C;&#x6B62;&#x9057;&#x5FD8;&#x3001;&#x575A;&#x6301;&#x6539;&#x53D8;&#x7684;&#x5DE5;&#x5177;&#x662F;&#x7EB8;&#x548C;&#x7B14;&#x201D;&#xFF0C;&#x6240;&#x4EE5;&#x624D;&#x5F00;&#x59CB;&#x8BB0;&#x5F55;&#x3002;&#x53EF;&#x662F;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x600E;&#x4E48;&#x7ADF;&#x7136;&#x8FDE;&#x8BB0;&#x5F55;&#x672C;&#x8EAB;&#x90FD;&#x5FD8;&#x4E86;&#xFF01;</p>
<p>&#x7EC8;&#x7A76;&#x6211;&#x8FD8;&#x662F;&#x627E;&#x5230;&#x4E86;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x3002;&#x6211;&#x8DD1;&#x5230;&#x6587;&#x5177;&#x5E97;&#x4E70;&#x4E86;&#x5F88;&#x591A;3M&#x968F;&#x624B;&#x8D34;&#xFF08;Post-it&#xFF09;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x7F51;&#x4E0A;&#x4E0B;&#x8F7D;&#x4E86;&#x4E00;&#x4E2A;&#x53EB;&#x201C;3M Post-it Notes Lite&#x201D;&#x7684;&#x514D;&#x8D39;&#x8F6F;&#x4EF6;&#x3002;&#x628A;&#x9700;&#x8981;&#x63D0;&#x9192;&#x81EA;&#x5DF1;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x7684;&#x91CD;&#x8981;&#x4E8B;&#x9879;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x90A3;&#x4E9B;&#x6700;&#x8FD1;&#x51B3;&#x5B9A;&#x9700;&#x8981;&#x517B;&#x6210;&#x7684;&#x4E60;&#x60EF;&#x8D34;&#x5F97;&#x968F;&#x5904;&#x90FD;&#x662F;&#xFF0C;&#x5305;&#x62EC;&#x7535;&#x8111;&#x7684;&#x684C;&#x9762;&#x4E0A;&#x3002;&#x53EF;&#x662F;&#x6211;&#x53D1;&#x73B0;&#x8FD8;&#x662F;&#x4E0D;&#x591F;&#xFF0C;3M&#x968F;&#x624B;&#x8D34;&#x6495;&#x4E0B;&#x6765;&#x7684;&#x7EB8;&#x6761;&#x662F;&#x5E26;&#x7740;&#x80F6;&#x7684;&#xFF0C;&#x653E;&#x5728;&#x53E3;&#x888B;&#x91CC;&#x5F88;&#x4E0D;&#x8212;&#x670D;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x5C31;&#x8DD1;&#x5230;&#x540D;&#x7247;&#x5E97;&#xFF0C;&#x4E70;&#x4E86;&#x4E24;&#x76D2;&#x7A7A;&#x767D;&#x540D;&#x7247;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x9879;&#x5199;&#x5728;&#x8FD9;&#x4E9B;&#x7A7A;&#x767D;&#x5361;&#x7247;&#x4E0A;&#xFF0C;&#x968F;&#x8EAB;&#x643A;&#x5E26;&#x3002;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x7684;&#x53E3;&#x888B;&#x91CC;&#x6709;&#x597D;&#x51E0;&#x5F20;&#x5361;&#x7247;&#x4E0A;&#x5199;&#x7740;&#x540C;&#x6837;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x2014;&#x2014;&#x201C;&#x522B;&#x5FD8;&#x4E86;&#x6BCF;&#x5929;&#x665A;&#x4E0A;&#x8BB0;&#x5F55;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#xFF01;&#x201D; &#x8FD9;&#x6837;&#x505A;&#x7684;&#x6548;&#x679C;&#x975E;&#x5E38;&#x597D;&#x3002;&#x5E94;&#x4E86;&#x90A3;&#x53E5;&#x8BDD;&#xFF0C;&#x201C;&#x95EE;&#x9898;&#x95EE;&#x9898;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x95EE;&#x9898;&#x7B80;&#x5355;&#x7684;&#x3002;&#x201D;</p>
<p>&#x517B;&#x6210;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E60;&#x60EF;&#x90FD;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x9700;&#x8981;&#x591A;&#x4E45;&#x624D;&#x80FD;&#x771F;&#x6B63;&#x6210;&#x4E3A;&#x4E60;&#x60EF;&#xFF0C;&#x4E0E;&#x5929;&#x751F;&#x7684;&#x4E00;&#x6837;&#x81EA;&#x7136;&#x5462;&#xFF1F;&#x6211;&#x7684;&#x7ECF;&#x9A8C;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x4E00;&#x822C;&#x9700;&#x8981;&#x4E94;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5BF9;&#xFF0C;&#x662F;&#x4E94;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x6211;&#x770B;&#x5230;&#x8FC7;&#x5F88;&#x591A;&#x4E66;&#x7C4D;&#x4E0A;&#x8BF4;&#xFF0C;&#x4E24;&#x4E2A;&#x661F;&#x671F;&#x5C31;&#x53EF;&#x4EE5;&#x517B;&#x6210;&#x4E00;&#x4E2A;&#x4E60;&#x60EF;&#xFF1B;&#x6211;&#x60F3;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x6211;&#x7B28;&#x5427;&#x3002;// &#x786E;&#x5207;&#x9700;&#x8981;&#x591A;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x5F88;&#x96BE;&#x5B9A;&#x8BBA;&#xFF0C;&#x4F46;&#x4EE5;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x7EDD;&#x5BF9;&#x4E0D;&#x4F1A;&#x662F;&#x4E24;&#x5468;&#x6216;&#x662F;21&#x5929;&#x90A3;&#x4E48;&#x77ED;&#x3002;&#x4E50;&#x89C2;&#x662F;&#x597D;&#x4E8B;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x8981;&#x5728;&#x4E8B;&#x5B9E;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x4E50;&#x89C2;&#xFF0C;&#x51E1;&#x4E8B;&#x8981;&#x4EE5;&#x5C0A;&#x91CD;&#x4E8B;&#x5B9E;&#xFF08;&#x6216;&#x73B0;&#x5B9E;&#xFF09;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x662F;&#x81EA;&#x6B3A;&#x6B3A;&#x4EBA;&#x4E86;&#x3002;</p>
<p>&#x628A;&#x6BCF;&#x5929;&#x7684;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x57F9;&#x517B;&#x81EA;&#x5DF1;&#x7684;&#x6210;&#x5C31;&#x611F;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x8F7B;&#x6613;&#x539F;&#x8C05;&#x81EA;&#x5DF1;&#x3002;&#x6BCF;&#x5929;&#x665A;&#x4E0A;&#x7761;&#x89C9;&#x524D;&#xFF0C;&#x770B;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x672C;&#x5B50;&#xFF0C;&#x53D1;&#x73B0;&#x4ECA;&#x5929;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x4E8B;&#x513F;&#x7684;&#x8BDD;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x5F88;&#x5F00;&#x5FC3;&#x3002;&#x968F;&#x7740;&#x65E5;&#x5B50;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x4F60;&#x7684;&#x5FC3;&#x91CC;&#x5C31;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x8E0F;&#x5B9E;&#xFF0C;&#x54EA;&#x6015;&#x4E0D;&#x53BB;&#x7FFB;&#x9605;&#xFF0C;&#x53EA;&#x987B;&#x770B;&#x770B;&#x672C;&#x5B50;&#x4E2D;&#x8FB9;&#x7F18;&#x53D8;&#x5F97;&#x7A0D;&#x5FAE;&#x6709;&#x70B9;&#x513F;&#x9ED1;&#x7684;&#x90E8;&#x5206;&#x8D8A;&#x6765;&#x8D8A;&#x539A;&#xFF0C;&#x5C31;&#x4F1A;&#x5F88;&#x6709;&#x6210;&#x5C31;&#x611F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x4EC5;&#x51ED;&#x90A3;&#x9760;&#x4E0D;&#x4F4F;&#x7684;&#x5FD8;&#x8BB0;&#xFF0C;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x6709;&#x8FD9;&#x79CD;&#x5B9E;&#x5728;&#x7684;&#x611F;&#x89C9;&#x7684;&#x3002;// &#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7ECF;&#x5E38;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x5B9E;&#x9A8C;&#x5BF9;&#x8C61;&#x7684;&#x4EBA;&#xFF0C;&#x540C;&#x610F;&#x8FD9;&#x70B9;&#x8BF4;&#x6CD5;&#x3002;</p>
<p>&#x53CD;&#x8FC7;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6253;&#x5F00;&#x90A3;&#x4E2A;&#x672C;&#x5B50;&#xFF0C;&#x7ADF;&#x7136;&#x53D1;&#x73B0;&#x6700;&#x540E;&#x4E00;&#x9875;&#x8BB0;&#x5F55;&#x7684;&#x65E5;&#x671F;&#x662F;&#x597D;&#x51E0;&#x5929;&#x524D;&#x751A;&#x81F3;&#x4E0A;&#x4E2A;&#x6708;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x4F1A;&#x5FC3;&#x614C;&#x5E76;&#x4E14;&#x6127;&#x759A;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x5C31;&#x662F;&#x4F60;&#x53BB;&#x505A;&#x4E00;&#x4E9B;&#x201C;&#x6B63;&#x7ECF;&#x4E8B;&#x513F;&#x201D;&#x7684;&#x6700;&#x5B9E;&#x5728;&#x7684;&#x52A8;&#x529B;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x4EC5;&#x51ED;&#x90A3;&#x9760;&#x4E0D;&#x4F4F;&#x7684;&#x8BB0;&#x5FC6;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x5F88;&#x5BB9;&#x6613;&#x539F;&#x8C05;&#x81EA;&#x5DF1;&#xFF0C;&#x7EE7;&#x7EED;&#x653E;&#x7EB5;&#x4E0B;&#x53BB;&#xFF0C;&#x8BA9;&#x65F6;&#x95F4;&#x767D;&#x767D;&#x5EA6;&#x8FC7;&#xFF0C;&#x4E0D;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x4E00;&#x70B9;&#x6536;&#x76CA;&#x3002;&#x6700;&#x8981;&#x547D;&#x7684;&#x3001;&#x4E5F;&#x66F4;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x4F60;&#x6CA1;&#x6709;&#x8BB0;&#x5F55;&#x800C;&#x5E26;&#x6765;&#x7684;&#x7ED3;&#x679C;&#x662F;&#xFF1A;&#x4F60;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x4F53;&#x4F1A;&#x5230;&#x81EA;&#x5DF1;&#x6709;&#x4EFB;&#x4F55;&#x7406;&#x7531;&#x81EA;&#x8D23;&#x2014;&#x2014;&#x56E0;&#x4E3A;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x5931;&#x53BB;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x4EE5;&#x524D;&#x63D0;&#x5230;&#x8FC7;&#x4EBA;&#x7C7B;&#x7684;&#x5C34;&#x5C2C;&#x662F;&#xFF1A;&#x5728;&#x6574;&#x4E2A;&#x4EBA;&#x7C7B;&#x53D1;&#x5C55;&#x5230;&#x524D;&#x6240;&#x672A;&#x6709;&#x7684;&#x9AD8;&#x5EA6;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x5FC3;&#x667A;&#x6210;&#x957F;&#x5374;&#x8981;&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x2014;&#x2014;&#x6240;&#x4EE5;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x6700;&#x7EC8;&#x6CA1;&#x6709;&#x8FDB;&#x5316;&#x6210;&#x771F;&#x6B63;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x4EBA;&#x3002;&#x800C;&#x66F4;&#x5C34;&#x5C2C;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x9053;&#x7406;&#x90FD;&#x660E;&#x767D;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x662F;&#x4F1A;&#x4E00;&#x4E0D;&#x7559;&#x795E;&#x5C31;&#x88AB;&#x81EA;&#x5DF1;&#x7684;&#x5927;&#x8111;&#x63A7;&#x5236;&#x3002;</p>
<p>&#x4ECE;&#x4ECA;&#x5929;&#x5F00;&#x59CB;&#xFF0C;&#x517B;&#x6210;&#x8BB0;&#x5F55;&#x4F60;&#x6BCF;&#x65E5;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#x7684;&#x4E60;&#x60EF;&#x5427;&#x3002;&#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x5F88;&#x591A;&#x826F;&#x597D;&#x7684;&#x65F6;&#x95F4;&#x4F7F;&#x7528;&#x4E60;&#x60EF;&#x90FD;&#x4F1A;&#x56E0;&#x6B64;&#x81EA;&#x7136;&#x5730;&#x517B;&#x6210;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5DF2;&#x7ECF;&#x4E60;&#x60EF;&#x6BCF;&#x5929;&#x665A;&#x4E0A;&#x7761;&#x89C9;&#x4E4B;&#x524D;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x5F53;&#x65E5;&#x7684;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x65E9;&#x4E0A;&#x5C31;&#x4F1A;&#x5F88;&#x81EA;&#x7136;&#x5730;&#x5F00;&#x59CB;&#x5728;&#x8111;&#x91CC;&#x89C4;&#x5212;&#x5168;&#x5929;&#x7684;&#x65F6;&#x95F4;&#x4E86;&#x2014;&#x2014;&#x4E0D;&#x4FE1;&#x4F60;&#x5C31;&#x8BD5;&#x8BD5;&#x770B;&#xFF01;</p>
<p>&#x5224;&#x65AD;&#x4E00;&#x9879;&#x4EFB;&#x52A1;&#x662F;&#x5426;&#x201C;&#x771F;&#x7684;&#x91CD;&#x8981;&#x201D;&#xFF0C;&#x5176;&#x5B9E;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#xFF1A;&#x5C31;&#x662F;&#x770B;&#x8FD9;&#x9879;&#x4EFB;&#x52A1;&#x7684;&#x5B8C;&#x6210;&#x662F;&#x5426;&#x5BF9;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x8FBE;&#x6210;&#x786E;&#x5B9E;&#x6709;&#x76CA;&#x3002;&#x53EF;&#x662F;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6B63;&#x5E38;&#x7684;&#x3001;&#x5404;&#x79CD;&#x5668;&#x5B98;&#x5B8C;&#x6574;&#x5065;&#x5168;&#x7684;&#x3001;&#x62E5;&#x6709;&#x4E03;&#x60C5;&#x516D;&#x6B32;&#x7684;&#x666E;&#x901A;&#x4EBA;&#x6765;&#x8BB2;&#xFF0C;&#x4E0D;&#x6323;&#x624E;&#x4E00;&#x4E0B;&#xFF0C;&#x5C31;&#x5F88;&#x96BE;&#x5B8C;&#x5168;&#x4E13;&#x6CE8;&#x4E8E;&#x8FD9;&#x4E2A;&#x6700;&#x5173;&#x952E;&#x6700;&#x6839;&#x672C;&#x7684;&#x51B3;&#x7B56;&#x6807;&#x51C6;&#x3002;</p>
<p>&#x76F8;&#x4FE1;&#x6211;&#xFF0C;&#x517B;&#x6210;&#x4EFB;&#x52A1;&#x4E00;&#x4E2A;&#x54EA;&#x6015;&#x5F88;&#x5C0F;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x90FD;&#x662F;&#x8981;&#x6323;&#x624E;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8C8C;&#x4F3C;&#x75DB;&#x82E6;&#x7684;&#x6323;&#x624E;&#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x5C06;&#x6765;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x523B;&#x7EC8;&#x5F52;&#x4F1A;&#x53D8;&#x5F97;&#x5176;&#x4E50;&#x65E0;&#x7A77;&#x3002;</p>
<p>&#x771F;&#x6B63;&#x7D27;&#x6025;&#x7684;&#x4E8B;&#x513F;&#x5C11;&#x4E4B;&#x53C8;&#x5C11;&#xFF0C;&#x5341;&#x4E07;&#x706B;&#x6025;&#x51E0;&#x4E4E;&#x53EA;&#x662F;&#x51FA;&#x73B0;&#x5728;&#x6545;&#x4E8B;&#x91CC;&#x3002;&#x4E0D;&#x4FE1;&#x4F60;&#x5C31;&#x5C1D;&#x8BD5;&#x7740;&#x628A;&#x6240;&#x6709;&#x4F60;&#x89C9;&#x5F97;&#x7D27;&#x6025;&#x7684;&#x4E8B;&#x513F;&#x5EF6;&#x8FDF;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x518D;&#x5904;&#x7406;&#xFF0C;&#x5982;&#x6B64;&#x575A;&#x6301;&#x4E00;&#x4E2A;&#x6708;&#x5DE6;&#x53F3;&#x3002;&#x6700;&#x7EC8;&#x4F60;&#x5C31;&#x4F1A;&#x660E;&#x767D;&#x90A3;&#x4E9B;&#x4E8B;&#x513F;&#x5B9E;&#x9645;&#x4E0A;&#x90FD;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x7D27;&#x6025;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5224;&#x65AD;&#x6807;&#x51C6;&#x5C31;&#x591F;&#x4E86;&#xFF1A;&#x8FD9;&#x4E8B;&#x513F;&#x662F;&#x5426;&#x771F;&#x7684;&#x91CD;&#x8981;&#x3002;&#x518D;&#x5F80;&#x540E;&#x7684;&#x9053;&#x7406;&#x5C31;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#x4E86;&#xFF1A;&#x771F;&#x6B63;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4EFB;&#x52A1;&#x6C38;&#x8FDC;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x2014;&#x2014;&#x90A3;&#x4E2A;&#x771F;&#x6B63;&#x5BF9;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x5B9E;&#x73B0;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x4EFB;&#x52A1;&#x3002;</p>
<p>&#x4E00;&#x4E8B;&#x65E0;&#x6210;&#x7684;&#x6700;&#x6839;&#x672C;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x653E;&#x5F03;&#x3002;&#x653E;&#x5F03;&#x7684;&#x539F;&#x56E0;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x662F;&#x201C;&#x6362;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5411;&#x201D;&#x3002;&#x5982;&#x679C;&#x786E;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5411;&#x5012;&#x4E5F;&#x7F62;&#x4E86;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x597D;&#x50CF;&#x201C;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5411;&#x201D;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x5982;&#x6B64;&#x4E0B;&#x53BB;&#xFF0C;&#x4F60;&#x4F1A;&#x4E0D;&#x505C;&#x5730;&#x53D1;&#x73B0;&#x201C;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5411;&#x201D;&#x3002;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x8BEF;&#x4EE5;&#x4E3A;&#x80FD;&#x591F;&#x4E0D;&#x505C;&#x5730;&#x627E;&#x5230;&#x201C;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5411;&#x201D;&#x7684;&#x4EBA;&#x53EA;&#x6709;&#x4F60;&#x4E00;&#x4E2A;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x4E0D;&#x505C;&#x5730;&#x201C;&#x627E;&#x5230;&#x201D;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x600E;&#x4E48;&#x4E0D;&#x89C1;&#x5927;&#x5BB6;&#x90FD;&#x6210;&#x529F;&#x5462;&#xFF1F;&#x6211;&#x4ECE;&#x6765;&#x90FD;&#x4E0D;&#x76F8;&#x4FE1;&#x4EBA;&#x4EBA;&#x90FD;&#x80FD;&#x6210;&#x529F;&#x4E4B;&#x7C7B;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x9876;&#x591A;&#x76F8;&#x4FE1;&#x201C;&#x5176;&#x5B9E;&#x4EBA;&#x4EBA;&#x539F;&#x672C;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x6210;&#x529F;&#x201D;&#x3002;&#x6211;&#x603B;&#x89C9;&#x5F97;&#x4E00;&#x4E2A;&#x4EBA;&#x6700;&#x7EC8;&#x6210;&#x529F;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x66FE;&#x7ECF;&#x7CBE;&#x786E;&#x5730;&#x8BA1;&#x5212;&#x81EA;&#x5DF1;&#x7684;&#x6210;&#x529F;&#xFF0C;&#x5173;&#x952E;&#x5728;&#x4E8E;&#x4ED6;&#x7684;&#x575A;&#x6301;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x8BA1;&#x5212;&#x7684;&#x671F;&#x9650;&#x7A76;&#x7ADF;&#x5E94;&#x8BE5;&#x8BBE;&#x4E3A;&#x591A;&#x4E45;&#x624D;&#x53EF;&#x80FD;&#x7528;&#x6211;&#x5E73;&#x51E1;&#x751A;&#x81F3;&#x5E73;&#x5EB8;&#x7684;&#x80FD;&#x529B;&#x548C;&#x5929;&#x5206;&#x987A;&#x5229;&#x5B9E;&#x65BD;&#x5462;&#xFF1F;&#x6211;&#x5C1D;&#x8BD5;&#x8FC7;&#x4E00;&#x5E74;&#xFF0C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7ADF;&#x7136;&#x8FDE;&#x4E00;&#x5E74;&#x7684;&#x8BA1;&#x5212;&#x90FD;&#x6CA1;&#x80FD;&#x529B;&#x5B8C;&#x6210;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x518D;&#x4E00;&#x6B21;&#x5E73;&#x9759;&#x63A5;&#x53D7;&#x81EA;&#x5DF1;&#x5929;&#x5206;&#x5E73;&#x5E73;&#x7684;&#x4E8B;&#x5B9E;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E00;&#x53E3;&#x6C14;&#x628A;&#x671F;&#x9650;&#x7F29;&#x77ED;&#x5230;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#x3002;&#x7EC8;&#x4E8E;&#x53D1;&#x73B0;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8BA1;&#x5212;&#x7684;&#x671F;&#x9650;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#xFF0C;&#x6211;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x575A;&#x6301;&#xFF0C;&#x5E76;&#x4E14;&#x5F80;&#x5F80;&#x53EF;&#x4EE5;&#x51FA;&#x8272;&#x5730;&#x5B8C;&#x6210;&#x7684;&#x3002;&#xFF08;// me too&#xFF09;&#x8FD9;&#x4E2A;&#x53D1;&#x73B0;&#x4EE4;&#x6211;&#x5F88;&#x5F00;&#x5FC3;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x6211;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x7684;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x6211;&#x7ADF;&#x7136;&#x53EF;&#x4EE5;&#x6162;&#x6162;&#x628A;&#x671F;&#x9650;&#x5EF6;&#x957F;&#xFF0C;&#x4E24;&#x4E2A;&#x661F;&#x671F;&#xFF0C;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x751A;&#x81F3;&#x7ADF;&#x7136;&#x53EF;&#x4EE5;&#x5236;&#x5B9A;&#x4E00;&#x4E2A;&#x5B63;&#x5EA6;&#x7684;&#x8BA1;&#x5212;&#x4E86;&#xFF01;&#xFF08;// &#x8FD9;&#x662F;&#x7EC3;&#x4E60;&#x575A;&#x6301;&#x7684;&#x597D;&#x529E;&#x6CD5;&#xFF0C;&#x6162;&#x6162;&#x52A0;&#x957F;&#x65F6;&#x95F4;&#x3002;&#xFF09;</p>
<p>&#x505A;&#x8BA1;&#x5212;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x77E5;&#x9053;&#x8FD9;&#x6837;&#x4E00;&#x4EF6;&#x4E8B;&#xFF1A;&#x505A;&#x957F;&#x671F;&#x8BA1;&#x5212;&#x663E;&#x7136;&#x662F;&#x6B63;&#x786E;&#x7684;&#x5E76;&#x4E14;&#x662F;&#x5FC5;&#x9700;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x80FD;&#x529B;&#x5236;&#x4F5C;&#x957F;&#x671F;&#x8BA1;&#x5212;&#x7684;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x80FD;&#x529B;&#xFF0C;&#x4E5F;&#x51E0;&#x4E4E;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x80FD;&#x529B;&#x4E4B;&#x4E00;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x6323;&#x624E;&#xFF0C;&#x9700;&#x8981;&#x52AA;&#x529B;&#xFF0C;&#x9700;&#x8981;&#x4ECE;&#x4E00;&#x70B9;&#x4E00;&#x6EF4;&#x5F00;&#x59CB;&#x3002;&#x4E0D;&#x8981;&#x4E00;&#x4E0A;&#x6765;&#x5C31;&#x5F00;&#x59CB;&#x5236;&#x5B9A;&#x8FC7;&#x5206;&#x957F;&#x671F;&#x7684;&#x8BA1;&#x5212;&#x3002;&#x54EA;&#x6015;&#x5236;&#x5B9A;&#x4E00;&#x4E2A;&#x4E00;&#x661F;&#x671F;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x90FD;&#x4E0D;&#x662F;&#x4EF6;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#x2014;&#x2014;&#x5982;&#x679C;&#x4F60;&#x771F;&#x7684;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x5B9E;&#x8DF5;&#x5C31;&#x77E5;&#x9053;&#x4E86;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x5F53;&#x5E74;&#x90A3;&#x6837;&#x3002;&#x4E0D;&#x8981;&#x65E0;&#x77E5;&#x65E0;&#x754F;&#x3002;&#x7136;&#x540E;&#x4E5F;&#x6CA1;&#x5FC5;&#x8981;&#x5FC3;&#x5B58;&#x60F6;&#x6050;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x53EA;&#x8981;&#x52AA;&#x529B;&#x5C31;&#x5FC5;&#x7136;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x7684;&#x80FD;&#x529B;&#x2014;&#x2014;&#x653E;&#x5FC3;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x662F;&#x5929;&#x751F;&#x7684;&#xFF0C;&#x90FD;&#x662F;&#x540E;&#x5929;&#x4E70;&#x5F97;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E00;&#x751F;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x5927;&#x591A;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x8BD5;&#x9519;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5BF9;&#x4E8E;&#x4EBA;&#x751F;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x80FD;&#x50CF;&#x89E3;&#x91CA;&#x6570;&#x5B66;&#x90A3;&#x6837;&#x7ED9;&#x51FA;&#x666E;&#x9002;&#x7684;&#x516C;&#x5F0F;&#x3002;&#x6C38;&#x8FDC;&#x8BB0;&#x4F4F;&#xFF0C;&#x9A6C;&#x4E0A;&#x884C;&#x52A8;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x3002;// &#x8BA1;&#x5212;&#x4E5F;&#x8981;&#x5728;&#x8BD5;&#x9519;&#x4E2D;&#x4E0D;&#x65AD;&#x8C03;&#x6574;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x5F00;&#x59CB;&#x5F80;&#x5F80;&#x96BE;&#x4EE5;&#x4F30;&#x8BA1;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x53EA;&#x6709;&#x4E0D;&#x65AD;&#x5730;&#x5438;&#x53D6;&#x7ECF;&#x9A8C;&#x6559;&#x8BAD;&#xFF0C;&#x4E0D;&#x65AD;&#x8C03;&#x6574;&#x624D;&#x80FD;&#x505A;&#x51FA;&#x6070;&#x5F53;&#x7684;&#x8BA1;&#x5212;&#x3002;</p>
<h2 id="&#x5F00;&#x62D3;&#x6211;&#x4EEC;&#x7684;&#x5FC3;&#x667A;">&#x5F00;&#x62D3;&#x6211;&#x4EEC;&#x7684;&#x5FC3;&#x667A;</h2><h3 id="&#x7ECF;&#x9A8C;&#x76F8;&#x6096;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#x8FDB;&#x5C55;&#x7406;&#x89E3;&#x89C1;&#x8BC6;&#x6559;&#x8BB0;&#x7B14;&#x8BB0;">&#x7ECF;&#x9A8C;&#x76F8;&#x6096;&#xFF0C;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#xFF0C;&#x8FDB;&#x5C55;&#x7406;&#x89E3;&#xFF0C;&#x89C1;&#x8BC6;&#xFF0C;&#x6559;&#xFF0C;&#x8BB0;&#x7B14;&#x8BB0;</h3><p>&#x7262;&#x8BB0;&#x8FD9;&#x4E16;&#x754C;&#x786E;&#x5B9E;&#x5B58;&#x5728;&#x201C;&#x4E0E;&#x73B0;&#x6709;&#x7ECF;&#x9A8C;&#x76F8;&#x6096;&#x7684;&#x77E5;&#x8BC6;&#x201D;&#x3002;&#x800C;&#x540E;&#x628A;&#x8FD9;&#x53E5;&#x8BDD;&#x53D8;&#x6210;&#x73B0;&#x5B58;&#x7ECF;&#x9A8C;&#xFF0C;&#x7528;&#x5B83;&#x53BB;&#x7C7B;&#x6BD4;&#x672A;&#x77E5;&#x3002;&#x800C;&#x540E;&#xFF0C;&#x5FC5;&#x987B;&#x6295;&#x5165;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x53BB;&#x5B66;&#x4E60;&#x548C;&#x638C;&#x63E1;&#x201C;&#x79D1;&#x5B66;&#x65B9;&#x6CD5;&#x8BBA;&#x201D;&#xFF0C;&#x6323;&#x624E;&#x7740;&#x8FDB;&#x5316;&#x6210;&#x771F;&#x6B63;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x4EBA;&#x7C7B;&#x3002;</p>
<p>&#x66FE;&#x5728;&#x67D0;&#x672C;&#x4E66;&#x4E0A;&#x770B;&#x5230;&#x4E00;&#x53E5;&#x975E;&#x5E38;&#x4EE4;&#x4EBA;&#x9707;&#x52A8;&#x7684;&#x63CF;&#x8FF0;&#xFF1A;&#x201C;&#x5F88;&#x591A;&#x4EBA;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x76EE;&#x6807;&#x624D;&#x4E0D;&#x505C;&#x5730;&#x2019;&#x5B66;&#x4E60;&#x2019; &#x201D;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x6168;&#x53F9;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E4B;&#x540E;&#x624D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x771F;&#x6B63;&#x6709;&#x7528;&#xFF0C;&#x53EF;&#x662F;&#x201C;&#x4E66;&#x5230;&#x7528;&#x65F6;&#x65B9;&#x6068;&#x5C11;&#x201D;&#x3002;&#x5982;&#x679C;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x4E0D;&#x662F;&#x5F88;&#x61D2;&#x60F0;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#x5B66;&#x90FD;&#x4E0D;&#x665A;&#xFF01;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x5B66;&#x4E60;&#x624D;&#x5F00;&#x59CB;&#x3002;</p>
<p>&#x81EA;&#x5B66;&#x80FD;&#x529B;&#x7684;&#x6253;&#x9020;&#x5C31;&#x662F;&#x4ECE;&#x4F60;&#x8BA4;&#x771F;&#x5BF9;&#x5F85;&#x5B83;&#x5F00;&#x59CB;&#xFF0C;&#x5B83;&#x5C31;&#x50CF;&#x4F60;&#x7684;&#x604B;&#x4EBA;&#x4E00;&#x6837;&#xFF0C;&#x4F60;&#x5BF9;&#x5B83;&#x597D;&#xFF0C;&#x5B83;&#x624D;&#x5BF9;&#x4F60;&#x597D;&#x3002;&#x5B8C;&#x5168;&#x9760;&#x81EA;&#x5DF1;&#x5B66;&#x4E00;&#x6837;&#x4E1C;&#x897F;&#x5427;&#xFF0C;&#x7BA1;&#x5B83;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x5E76;&#x4E14;&#x4E00;&#x5B9A;&#x8981;&#x5B66;&#x597D;&#xFF0C;&#x5B66;&#x5230;&#x6BD4;&#x76F8;&#x5F53;&#x6570;&#x91CF;&#x7684;&#x4EBA;&#x90FD;&#x597D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x771F;&#x7684;&#x505A;&#x5230;&#x8FD9;&#x4E2A;&#x5730;&#x6B65;&#xFF0C;&#x90A3;&#x4F60;&#x4E0D;&#x4EC5;&#x5DF2;&#x7ECF;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x4EBA;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#x2014;&#x2014;&#x54C8;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5BF9;&#x4F60;&#x81EA;&#x5DF1;&#x8BF4;&#x201C;&#x4F60;&#x592A;&#x6709;&#x624D;&#x4E86;&#xFF01;&#x201D;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x5EFA;&#x8BAE;&#x662F;&#x53BB;&#x81EA;&#x89C9;&#x4E00;&#x95E8;&#x8BA1;&#x7B97;&#x673A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x5173;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x6709;&#x6700;&#x5E7F;&#x6CDB;&#x6700;&#x5168;&#x9762;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x4F18;&#x79C0;&#x7684;&#x8D44;&#x6E90;&#x5F80;&#x5F80;&#x662F;&#x82F1;&#x6587;&#x6587;&#x6863;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x987A;&#x5E26;&#x8FD8;&#x7EC3;&#x4E60;&#x4E86;&#x82F1;&#x6587;&#x9605;&#x8BFB;&#x7406;&#x89E3;&#x80FD;&#x529B;&#x2014;&#x2014;&#x60F3;&#x60F3;&#x5427;&#xFF0C;&#x80AF;&#x5B9A;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E3E;&#x4E24;&#x5F97;&#x3002;</p>
<p>&#x5982;&#x679C;&#xFF0C;&#x4F60;&#x628A;&#x65F6;&#x95F4;&#x548C;&#x8FDB;&#x5C55;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x4EC5;&#x4EC5;&#x7406;&#x89E3;&#x4E3A;&#x7EAF;&#x7CB9;&#x7684;&#x7EBF;&#x6027;&#x5173;&#x7CFB;&#xFF0C;&#x90A3;&#x4F60;&#x6700;&#x7EC8;&#x6839;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x9047;&#x5230;&#x4F60;&#x6240;&#x6EE1;&#x610F;&#x7684;&#x8FDB;&#x5C55;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x6CA1;&#x6709;&#x54EA;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x957F;&#x65F6;&#x95F4;&#x5FCD;&#x53D7;&#x5931;&#x671B;&#x3002;&#x8FD9;&#x6837;&#x770B;&#x6765;&#xFF0C;&#x4F60;&#x66FE;&#x7ECF;&#x7684;&#x653E;&#x5F03;&#xFF0C;&#x5F80;&#x5F80;&#x5E76;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x6CA1;&#x6709;&#x6BC5;&#x529B;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x5BF9;&#x65F6;&#x95F4;&#x548C;&#x8FDB;&#x5C55;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x7406;&#x89E3;&#x9519;&#x8BEF;&#x9020;&#x6210;&#x7684;&#x3002;</p>
<p>&#x89C1;&#x8BC6;&#x8D8A;&#x5C11;&#x7684;&#x4EBA;&#x8D8A;&#x559C;&#x6B22;&#x7528;&#x81EA;&#x5DF1;&#x6240;&#x6709;&#x7684;&#x89C1;&#x8BC6;&#x4F5C;&#x4E3A;&#x5224;&#x65AD;&#x4F9D;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x5B8C;&#x5168;&#x4E0D;&#x987E;&#x81EA;&#x5DF1;&#x89C1;&#x8BC6;&#x7684;&#x5C40;&#x9650;&#xFF0C;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x7684;&#x89C1;&#x8BC6;&#x6709;&#x5C40;&#x9650;&#x3002;</p>
<p>&#x6559;&#x662F;&#x6700;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x542C;&#x542C;&#x529D;&#xFF0C;&#x4ECE;&#x4ECA;&#x5929;&#x5F00;&#x59CB;&#x517B;&#x6210;&#x968F;&#x65F6;&#x8BB0;&#x7B14;&#x8BB0;&#x7684;&#x4E60;&#x60EF;&#x5427;&#x3002;&#x76F8;&#x4FE1;&#x6211;&#xFF0C;&#x6700;&#x6734;&#x7D20;&#x7684;&#x7EB8;&#x548C;&#x7B14;&#x662F;&#x6700;&#x6709;&#x6548;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x53EA;&#x6709;&#x8BB0;&#x7B14;&#x8BB0;&#x6210;&#x4E3A;&#x957F;&#x671F;&#x4E60;&#x60EF;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x4F1A;&#x771F;&#x6B63;&#x4F53;&#x4F1A;&#x5230;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x597D;&#x5904;&#x3002;&#x800C;&#x90A3;&#x4E9B;&#x81EA;&#x4F5C;&#x806A;&#x660E;&#x4E0D;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x4EBA;&#xFF0C;&#x53EA;&#x4F1A;&#x56E0;&#x4E3A;&#x4ECE;&#x672A;&#x4F53;&#x4F1A;&#x5230;&#x90A3;&#x6837;&#x7684;&#x597D;&#x5904;&#x800C;&#x201C;&#x65E0;&#x6028;&#x65E0;&#x6094;&#x201D;&#x3002;</p>
<h3 id="&#x5C0F;&#x5FC3;&#x6240;&#x8C13;&#x6210;&#x529F;&#x5B66;">&#x5C0F;&#x5FC3;&#x6240;&#x8C13;&#x201D;&#x6210;&#x529F;&#x5B66;&#x201D;</h3><h3 id="&#x52AA;&#x529B;&#x4EBA;&#x7684;&#x533A;&#x522B;&#x5931;&#x8D25;&#x6709;&#x6548;&#x4EBA;&#x8109;&#x6301;&#x7EED;&#x5B66;&#x4E60;&#x751F;&#x6D3B;&#x667A;&#x6167;&#x5173;&#x5FC3;&#x670B;&#x53CB;&#x5E78;&#x798F;">&#x52AA;&#x529B;&#xFF0C;&#x4EBA;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x5931;&#x8D25;&#xFF0C;&#x6709;&#x6548;&#x4EBA;&#x8109;&#xFF0C;&#x6301;&#x7EED;&#x5B66;&#x4E60;&#xFF0C;&#x751F;&#x6D3B;&#x667A;&#x6167;&#xFF0C;&#x5173;&#x5FC3;&#xFF0C;&#x670B;&#x53CB;&#xFF0C;&#x5E78;&#x798F;</h3><p>&#x52AA;&#x529B;&#x662F;&#x5E94;&#x5F53;&#x7684;&#xFF0C;&#x65E0;&#x987B;&#x5F3A;&#x8C03;&#x3002;</p>
<p>&#x63A5;&#x53D7;&#x81EA;&#x5DF1;&#x4E0E;&#x522B;&#x4EBA;&#x6CA1;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#xFF0C;&#x81F3;&#x5C11;&#x6CA1;&#x4EC0;&#x4E48;&#x672C;&#x8D28;&#x6027;&#x4E0A;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x662F;&#x5FC3;&#x667A;&#x6B63;&#x5E38;&#x6210;&#x957F;&#x7684;&#x91CD;&#x8981;&#x524D;&#x63D0;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x503E;&#x542C;&#x4EFB;&#x4F55;&#x4EBA;&#x8BB2;&#x8BDD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x4E0D;&#x5E94;&#x8BE5;&#x5E26;&#x7740;&#x201C;&#x9632;&#x5907;&#x3001;&#x8D28;&#x7591;&#x201D;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x90A3;&#x6837;&#x53EF;&#x80FD;&#x4F1A;&#x9057;&#x6F0F;&#x91CD;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x5FC3;&#x6001;&#x4F1A;&#x6210;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x6709;&#x8272;&#x773C;&#x955C;&#xFF0C;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x6536;&#x5230;&#x8FC7;&#x6EE4;&#x4E4B;&#x540E;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6700;&#x7EC8;&#x5BF9;&#x6240;&#x83B7;&#x5F97;&#x7684;&#x5168;&#x90E8;&#x4FE1;&#x606F;&#xFF0C;&#x4E0D;&#x52A0;&#x5206;&#x6790;&#xFF0C;&#x4E0D;&#x52A0;&#x601D;&#x8003;&#x5730;&#x5168;&#x76D8;&#x63A5;&#x53D7;&#xFF0C;&#x4E5F;&#x540C;&#x6837;&#x53EF;&#x80FD;&#x662F;&#x5371;&#x9669;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x6709;&#x5BB3;&#x7684;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x5B9E;&#x7528;&#x7684;&#x5EFA;&#x8BAE;&#x662F;&#xFF1A;&#x4E0D;&#x59A8;&#x53CD;&#x5176;&#x9053;&#x800C;&#x884C;&#x4E4B;&#x2014;&#x2014;&#x52AA;&#x529B;&#x4ECE;&#x5931;&#x8D25;&#x8005;&#x8EAB;&#x4E0A;&#x6C72;&#x53D6;&#x7ECF;&#x9A8C;&#x3002;</p>
<p>&#x6253;&#x9020;&#x4EBA;&#x8109;&#x4E0D;&#x5982;&#x6253;&#x9020;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x76F8;&#x4FE1;&#x6211;&#xFF0C;&#x6240;&#x8C13;&#x7684;&#x4EBA;&#x8109;&#x5C31;&#x7B97;&#x91CD;&#x8981;&#xFF0C;&#x4E5F;&#x6839;&#x672C;&#x6CA1;&#x4ED6;&#x4EEC;&#x8BF4;&#x7684;&#x90A3;&#x4E48;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x5F80;&#x5F80;&#x53EA;&#x6709;&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#x624D;&#x62E5;&#x6709;&#x6709;&#x6548;&#x7684;&#x4EBA;&#x8109;&#x3002;</p>
<p>&#x52AA;&#x529B;&#x5E76;&#x4E0D;&#x50CF;&#x4F20;&#x8BF4;&#x4E2D;&#x7684;&#x90A3;&#x4E48;&#x8270;&#x82E6;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x201C;&#x6BCF;&#x5929;&#x81F3;&#x5C11;&#x4E13;&#x5FC3;&#x5B66;&#x4E60;&#x5DE5;&#x4F5C;6&#x5C0F;&#x65F6;&#x201D;&#xFF1B;&#x8010;&#x5FC3;&#x5374;&#x8FDC;&#x6BD4;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x60F3;&#x8C61;&#x7684;&#x5DE8;&#x5927;&#xFF0C;&#x201C;&#x8981;&#x4E0E;&#x65F6;&#x95F4;&#x76F8;&#x4F34;&#x77ED;&#x5219;&#x81F3;&#x5C11;5&#x5E74;&#xFF0C;&#x957F;&#x5219;20&#x5E74;&#x201D;&#x3002;</p>
<p>&#x751F;&#x6D3B;&#x7684;&#x667A;&#x6167;&#x5C31;&#x5728;&#x4E8E;&#xFF0C;&#x96C6;&#x4E2D;&#x7CBE;&#x529B;&#x6539;&#x53D8;&#x90A3;&#x4E9B;&#x80FD;&#x591F;&#x6539;&#x53D8;&#x7684;&#xFF0C;&#x800C;&#x628A;&#x90A3;&#x4E9B;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x7684;&#x6682;&#x65F6;&#x5FFD;&#x7565;&#x6389;&#x3002;&#x4E13;&#x5FC3;&#x6253;&#x9020;&#x81EA;&#x5DF1;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x6253;&#x9020;&#x6210;&#x4E00;&#x4E2A;&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#xFF0C;&#x4E00;&#x4E2A;&#x6709;&#x7528;&#x7684;&#x4EBA;&#xFF0C;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x4EBA;&#xFF0C;&#x6BD4;&#x4EC0;&#x4E48;&#x90FD;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x5173;&#x5FC3;&#x6700;&#x7EC8;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8868;&#x73B0;&#xFF1A;&#x4E3A;&#x4E4B;&#x5FC3;&#x7518;&#x60C5;&#x613F;&#x5730;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#xFF0C;&#x54EA;&#x6015;&#x201C;&#x6D6A;&#x8D39;&#x201D;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x4E13;&#x5FC3;&#x505A;&#x53EF;&#x4EE5;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#xFF1B;&#x5B66;&#x4E60;&#x5E76;&#x62E5;&#x6709;&#x66F4;&#x591A;&#x66F4;&#x597D;&#x7684;&#x6280;&#x80FD;&#xFF1B;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x4EA4;&#x5F80;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x5B66;&#x4F1A;&#x72EC;&#x5584;&#x5176;&#x8EAB;&#xFF0C;&#x4EE5;&#x4E0D;&#x7ED9;&#x4ED6;&#x4EBA;&#x5236;&#x9020;&#x9EBB;&#x70E6;&#x4E3A;&#x7F8E;&#x5FB7;&#xFF1B;&#x7528;&#x4F60;&#x7684;&#x72EC;&#x7ACB;&#x8D62;&#x5F97;&#x5C0A;&#x91CD;&#x3002;</p>
<p>&#x9664;&#x975E;&#x6709;&#x7279;&#x6B8A;&#x539F;&#x56E0;&#xFF0C;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x56DE;&#x907F;&#x90A3;&#x4E9B;&#x8FDE;&#x7269;&#x8D28;&#x751F;&#x6D3B;&#x4E0A;&#x90FD;&#x4E0D;&#x80FD;&#x72EC;&#x5584;&#x5176;&#x8EAB;&#x7684;&#x4EBA;&#xFF1B;&#x90A3;&#x4E9B;&#x7CBE;&#x795E;&#x751F;&#x6D3B;&#x4E0A;&#x90FD;&#x4E0D;&#x80FD;&#x72EC;&#x5584;&#x5176;&#x8EAB;&#x7684;&#xFF0C;&#x5C31;&#x66F4;&#x5E94;&#x8BE5;&#x56DE;&#x907F;&#x4E86;&#x2014;&#x2014;&#x5C3D;&#x7BA1;&#x7504;&#x522B;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x771F;&#x6B63;&#x5173;&#x5FC3;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#x7684;&#x610F;&#x601D;&#x662F;&#x8BF4;&#xFF0C;&#x4F60;&#x60C5;&#x613F;&#x5728;&#x4ED6;&#x8EAB;&#x4E0A;&#x82B1;&#x8D39;&#x751A;&#x81F3;&#x6D6A;&#x8D39;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x8BB0;&#x4F4F;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5E78;&#x798F;&#x7A0B;&#x5EA6;&#xFF0C;&#x5F80;&#x5F80;&#x53D6;&#x51B3;&#x4E8E;&#x4ED6;&#x591A;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x53EF;&#x4EE5;&#x8131;&#x79BB;&#x5BF9;&#x5916;&#x90E8;&#x4E16;&#x754C;&#x7684;&#x4F9D;&#x9644;&#x3002;// &#x8D5E;&#x540C;</p>
<h2 id="&#x66F4;&#x591A;&#x601D;&#x8003;">&#x66F4;&#x591A;&#x601D;&#x8003;</h2><h3 id="&#x6548;&#x7387;&#x5956;&#x52B1;&#x60E9;&#x7F5A;&#x559C;&#x6B22;&#x65E0;&#x6CD5;&#x575A;&#x6301;&#x7B56;&#x7565;&#x8C26;&#x865A;">&#x6548;&#x7387;&#xFF0C;&#x5956;&#x52B1;&#x60E9;&#x7F5A;&#xFF0C;&#x559C;&#x6B22;&#xFF0C;&#x65E0;&#x6CD5;&#x575A;&#x6301;&#xFF0C;&#x7B56;&#x7565;&#xFF0C;&#x8C26;&#x865A;</h3><p>&#x8BB0;&#x4F4F;&#xFF0C;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x767E;&#x5206;&#x767E;&#x5730;&#x6709;&#x6548;&#x7387;&#xFF0C;&#x81F3;&#x5C11;&#x4E0D;&#x53EF;&#x80FD;&#x603B;&#x662F;&#x767E;&#x5206;&#x767E;&#x5730;&#x6709;&#x6548;&#x7387;&#x3002;</p>
<p>&#x4ED6;&#x4EEC;&#x7684;&#x6548;&#x7387;&#x5F88;&#x5DEE;&#x3002;&#x6839;&#x6E90;&#x5728;&#x4E8E;&#xFF0C;&#x4ED6;&#x4EEC;&#x5176;&#x5B9E;&#x53EA;&#x505A;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x800C;&#x56DE;&#x907F;&#x90A3;&#x4E9B;&#x6709;&#x96BE;&#x5EA6;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x53D7;&#x5230;&#x5956;&#x52B1;&#x4E4B;&#x540E;&#xFF0C;&#x539F;&#x672C;&#x6709;&#x4E24;&#x4E2A;&#x9009;&#x62E9;&#xFF1A;a. &#x518D;&#x6B21;&#x6765;&#x8FC7;&#xFF1B;b. &#x89C1;&#x597D;&#x5C31;&#x6536;&#x3002;&#x6709;&#x610F;&#x601D;&#x7684;&#x662F;&#xFF0C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4F1A;&#x81EA;&#x52A8;&#x5FFD;&#x89C6;&#x7B2C;&#x4E8C;&#x4E2A;&#x9009;&#x9879;&#xFF08;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x201C;&#x5E9E;&#x5179;&#x9A97;&#x5C40;&#x201D;&#x751F;&#x751F;&#x4E0D;&#x606F;&#x7684;&#x6839;&#x672C;&#x539F;&#x56E0;&#xFF09;&#x3002;&#x53D7;&#x5230;&#x60E9;&#x7F5A;&#x4E4B;&#x540E;&#xFF0C;&#x540C;&#x6837;&#x6709;&#x4E24;&#x4E2A;&#x9009;&#x9879;&#xFF1A;a. &#x4ECE;&#x6B64;&#x78B0;&#x90FD;&#x4E0D;&#x78B0;&#x90A3;&#x4EF6;&#x4E8B;&#x60C5;&#xFF1B;b. &#x6323;&#x624E;&#x7740;&#x627E;&#x4E00;&#x4E2A;&#x51FA;&#x8DEF;&#x3002;&#x540C;&#x6837;&#x597D;&#x73A9;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x6B21;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x8FD8;&#x662F;&#x4F1A;&#x81EA;&#x52A8;&#x5FFD;&#x89C6;&#x7B2C;&#x4E8C;&#x4E2A;&#x9009;&#x9879;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x5B9E;&#x9645;&#x4E0A;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x6240;&#x8C13;&#x7684;&#x201C;&#x559C;&#x6B22;&#x505A;&#x67D0;&#x4EF6;&#x4E8B;&#x60C5;&#x201D;&#x5B9E;&#x9645;&#x4E0A;&#x66F4;&#x53EF;&#x80FD;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x56E0;&#x4E3A;&#x90A3;&#x4EF6;&#x4E8B;&#x60C5;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#x3001;&#x5BB9;&#x6613;&#x83B7;&#x5F97;&#x5956;&#x52B1;&#x800C;&#x5DF2;&#x3002;&#x529E;&#x4E8B;&#x62D6;&#x62C9;&#x7684;&#x4EBA;&#x5176;&#x5B9E;&#x5E76;&#x975E;&#x4E0D;&#x505A;&#x4E8B;&#xFF0C;&#x4ED6;&#x4EEC;&#x505A;&#x4E8B;&#xFF0C;&#x751A;&#x81F3;&#x505A;&#x5F88;&#x591A;&#x4E8B;&#xFF1B;&#x4ED6;&#x4EEC;&#x4E5F;&#x5E76;&#x975E;&#x201C;&#x4E0D;&#x52AA;&#x529B;&#x201D;&#xFF0C;&#x4ED6;&#x4EEC;&#x82B1;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x53BB;&#x505A;&#x4E8B;&#x2014;&#x2014;&#x53EA;&#x4E0D;&#x8FC7;&#x4ED6;&#x4EEC;&#x82B1;&#x8D39;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x53EA;&#x505A;&#x5F88;&#x591A;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x6211;&#x5E38;&#x5E38;&#x89C2;&#x5BDF;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x4EBA;&#x4E3A;&#x4EC0;&#x4E48;&#x65E0;&#x6CD5;&#x575A;&#x6301;&#x2014;&#x2014;&#x5C3D;&#x7BA1;&#x4ED6;&#x4EEC;&#x548C;&#x90A3;&#x4E9B;&#x5C11;&#x6570;&#x6700;&#x7EC8;&#x575A;&#x6301;&#x4E0B;&#x6765;&#x7684;&#x4EBA;&#x4E00;&#x6837;&#xFF0C;&#x90FD;&#x6709;&#x7740;&#x826F;&#x597D;&#x7684;&#x613F;&#x671B;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x6027;&#x662F;&#xFF0C;&#x4ED6;&#x4EEC;&#x6700;&#x521D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x4E0B;&#x5B50;&#x7EC3;&#x5F97;&#x592A;&#x72E0;&#x4E86;&#x2014;&#x2014;&#x72E0;&#x5230;&#x4E0D;&#x8981;&#x8BF4;&#x4ED6;&#x4EEC;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x8C01;&#x90FD;&#x575A;&#x6301;&#x4E0D;&#x4E0B;&#x6765;&#x7684;&#x5730;&#x6B65;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x7684;&#x8BA1;&#x5212;&#x4E4B;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x575A;&#x6301;&#x5B8C;&#x6210;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x8BA1;&#x5212;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x201C;&#x8D85;&#x4EBA;&#x8BA1;&#x5212;&#x201D;&#x2014;&#x2014;&#x201C;&#x4E0D;&#x53EF;&#x80FD;&#x5B8C;&#x6210;&#x4E4B;&#x4EFB;&#x52A1;&#x201D;&#x3002;&#x6211;&#x7ECF;&#x5E38;&#x770B;&#x5230;&#x5B66;&#x751F;&#x8BA1;&#x5212;&#x4E0A;&#x5199;&#x7740;&#x201C;&#x6BCF;&#x5929;&#x80CC;200&#x4E2A;&#x5355;&#x8BCD;&#x201D;&#x3001;&#x201C;&#x6BCF;&#x5929;&#x5199;5&#x7BC7;&#x82F1;&#x6587;&#x4F5C;&#x6587;&#x201D;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x5F3A;&#x5EA6;&#xFF0C;&#x5BF9;&#x8D77;&#x6B65;&#x7684;&#x4EBA;&#x6765;&#x8BB2;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x201C;&#x8C8C;&#x4F3C;&#x53EF;&#x9760;&#x201D;&#x800C;&#x5DF2;&#xFF08;// &#x53EF;&#x80FD;&#x521A;&#x5F00;&#x59CB;&#x51E0;&#x5929;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x96BE;&#x575A;&#x6301;&#x4E0B;&#x6765;&#x7684;&#xFF0C;&#x65F6;&#x95F4;&#x4E5F;&#x5F80;&#x5F80;&#x4E0D;&#x5141;&#x8BB8;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x5929;&#x4F60;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x522B;&#x7684;&#x4E8B;&#x9700;&#x8981;&#x5904;&#x7406;&#xFF09;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x5306;&#x5306;&#x5FD9;&#x5FD9;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x60F3;&#x653E;&#x6162;&#x8282;&#x594F;&#x5B9E;&#x5728;&#x662F;&#x4E00;&#x4EF6;&#x975E;&#x5E38;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5E94;&#x8BE5;&#x8BB0;&#x4F4F;&#x7684;&#x662F;&#xFF1A;&#x51E1;&#x662F;&#x503C;&#x5F97;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90FD;&#x503C;&#x5F97;&#x6162;&#x6162;&#x505A;&#x2014;&#x2014;&#x505A;&#x5F88;&#x4E45;&#x5F88;&#x4E45;&#x3002;</p>
<p>&#x8981;&#x60F3;&#x529E;&#x6CD5;&#x63D0;&#x524D;&#x9884;&#x77E5;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x600E;&#x6837;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x7136;&#x540E;&#x786E;&#x5B9A;&#x90A3;&#x662F;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7EC3;&#x4E60;&#x771F;&#x6B63;&#x719F;&#x7EC3;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x800C;&#x540E;&#x5236;&#x5B9A;&#x957F;&#x671F;&#x8BA1;&#x5212;&#xFF0C;&#x4E00;&#x70B9;&#x4E00;&#x70B9;&#x5730;&#x6267;&#x884C;&#x8BE5;&#x8BA1;&#x5212;&#x3002;</p>
<p>&#x505A;&#x4E2A;&#x4E0D;&#x8FDF;&#x5230;&#x7684;&#x4EBA;&#x3002;1. &#x517B;&#x6210;&#x89C4;&#x5F8B;&#x751F;&#x6D3B;&#x7684;&#x4E60;&#x60EF;&#x3002; 2. &#x6BCF;&#x5929;&#x68C0;&#x67E5;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x95F4;&#x8868;&#x81F3;&#x5C11;&#x4E09;&#x6B21;&#x3002; 3. &#x5047;&#x5B9A;&#x81EA;&#x5DF1;&#x505A;&#x7684;&#x6BCF;&#x4EF6;&#x4E8B;&#x60C5;&#x9700;&#x8981;&#x7684;&#x65F6;&#x95F4;&#x6BD4;&#x60F3;&#x8C61;&#x4E2D;&#x66F4;&#x591A;&#x4E00;&#x70B9;&#x3002;4. &#x5047;&#x5B9A;&#x4F60;&#x6C38;&#x8FDC;&#x90FD;&#x4F1A;&#x9047;&#x5230;&#x4EA4;&#x901A;&#x5835;&#x585E;&#x3002;&#xFF08;// &#x5E26;&#x4E0A;&#x4E00;&#x672C;&#x4E66;&#x5728;&#x53D1;&#x751F;&#x8FD9;&#x4E9B;&#x610F;&#x5916;&#x65F6;&#x53EF;&#x4EE5;&#x4E0D;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3002;&#x8BB0;&#x4F4F;&#xFF0C;&#x610F;&#x5916;&#x603B;&#x662F;&#x53D1;&#x751F;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x7684;&#x8FD0;&#x6C14;&#x683C;&#x5916;&#x5DEE;&#xFF0C;&#x800C;&#x5F80;&#x5F80;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x8003;&#x8651;&#x5F97;&#x4E0D;&#x591F;&#x5468;&#x5168;&#x3002;&#xFF09;5. &#x5047;&#x5B9A;&#x5176;&#x4ED6;&#x4EBA;&#x90FD;&#x4F1A;&#x8FDF;&#x5230;&#x3002; 6. &#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x56E0;&#x4E3A;&#x522B;&#x4EBA;&#x4EE5;&#x81F4;&#x800C;&#x8D23;&#x602A;&#x4ED6;&#x4EEC;&#x3002;</p>
<p>&#x6210;&#x719F;&#x7684;&#x4EBA;&#x603B;&#x662F;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x8BA9;&#x522B;&#x4EBA;&#x8212;&#x670D;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6240;&#x8C13;&#x7684;&#x201C;&#x8C26;&#x865A;&#x201D;&#x548C;&#x201C;&#x4F4E;&#x8C03;&#x201D;&#x4E8B;&#x5B9E;&#x4E0A;&#x662F;&#x4E00;&#x79CD;&#x81EA;&#x6211;&#x4FDD;&#x62A4;&#x7684;&#x4F18;&#x5316;&#x7B56;&#x7565;&#x3002;</p>
<h2 id="&#x4ECE;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#x5F00;&#x59CB;&#x6539;&#x53D8;">&#x4ECE;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#x5F00;&#x59CB;&#x6539;&#x53D8;</h2><h3 id="&#x51C6;&#x5907;&#x52AA;&#x529B;&#x7075;&#x611F;&#x575A;&#x6301;&#x4E86;&#x89E3;&#x5C0F;&#x4EFB;&#x52A1;&#x601D;&#x8003;">&#x51C6;&#x5907;&#xFF0C;&#x52AA;&#x529B;&#xFF0C;&#x7075;&#x611F;&#xFF0C;&#x575A;&#x6301;&#xFF0C;&#x4E86;&#x89E3;&#xFF0C;&#x5C0F;&#x4EFB;&#x52A1;&#xFF0C;&#x601D;&#x8003;</h3><p>&#x5927;&#x591A;&#x6570;&#x4E8B;&#x60C5;&#x90FD;&#x9700;&#x8981;&#x63D0;&#x524D;&#x51C6;&#x5907;&#xFF0C;&#x4E5F;&#x90FD;&#x53EF;&#x4EE5;&#x63D0;&#x524D;&#x51C6;&#x5907;&#x3002;&#x8BA4;&#x8BC6;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x672C;&#x8EAB;&#x5C31;&#x51E0;&#x4E4E;&#x662F;&#x4E00;&#x5207;&#x6539;&#x53D8;&#x7684;&#x8D77;&#x70B9;&#x3002;</p>
<p>&#x4E0D;&#x8981;&#x65E0;&#x8C13;&#x5730;&#x76F8;&#x4FE1;&#x4EC0;&#x4E48;&#x201C;&#x7A81;&#x7136;&#x95EA;&#x73B0;&#x7684;&#x7075;&#x611F;&#x201D;&#x7684;&#x5B58;&#x5728;&#x3002;&#x7075;&#x611F;&#x8FD9;&#x4E1C;&#x897F;&#x5C31;&#x7B97;&#x5B58;&#x5728;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x662F;&#x5E73;&#x767D;&#x65E0;&#x6545;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x6709;&#x6765;&#x5386;&#x7684;&#x3002;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x8BF4;&#x7684;&#x201C;&#x91CF;&#x53D8;&#x5230;&#x8D28;&#x53D8;&#x201D;&#x7684;&#x90A3;&#x4E00;&#x77AC;&#x95F4;&#x7A81;&#x7136;&#x7EFD;&#x653E;&#x7684;&#x94C1;&#x6811;&#x4E4B;&#x82B1;&#x3002;</p>
<p>&#x4EBA;&#x5FC5;&#x987B;&#x52AA;&#x529B;&#x3002;&#x5982;&#x679C;&#x5927;&#x5BB6;&#x90FD;&#x52AA;&#x529B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x6700;&#x597D;&#x5C3D;&#x91CF;&#x5F00;&#x59CB;&#x52AA;&#x529B;&#xFF0C;&#x5E76;&#x4E14;&#x66F4;&#x52AA;&#x529B;&#x624D;&#x597D;&#x3002;&#x4EBA;&#x4EEC;&#x603B;&#x662F;&#x8BF4;&#xFF0C;&#x7B28;&#x9E1F;&#x5148;&#x98DE;&#xFF0C;&#x5176;&#x5B9E;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x9E1F;&#x4E4B;&#x6240;&#x4EE5;&#x5148;&#x98DE;&#x4E5F;&#x8BB8;&#x5E76;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7B28;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x66F4;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x66F4;&#x806A;&#x660E;&#x3002;</p>
<p>&#x65E9;&#x5C31;&#x8BF4;&#x8FC7;&#xFF0C;&#x6240;&#x8C13;&#x575A;&#x6301;&#x4E0D;&#x61C8;&#xFF0C;&#x5176;&#x672C;&#x8D28;&#x662F;&#x65F6;&#x95F4;&#x7684;&#x6295;&#x5165;&#x3002;&#x56E0;&#x4E3A;&#x4EBA;&#x4EEC;&#x5728;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x4E3A;&#x4E86;&#x6210;&#x529F;&#x575A;&#x6301;&#x4E0D;&#x61C8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6700;&#x7EC8;&#x4F1A;&#x53D1;&#x73B0;&#x5927;&#x591A;&#x7684;&#x52AA;&#x529B;&#x5176;&#x5B9E;&#x4E0D;&#x8FC7;&#x662F;&#x7B80;&#x5355;&#x800C;&#x53C8;&#x8C8C;&#x4F3C;&#x67AF;&#x71E5;&#x7684;&#x91CD;&#x590D;&#x3002;&#x6BD5;&#x6DD1;&#x654F;&#x5728;&#x5979;&#x7684;&#x5C0F;&#x8BD5;&#x300A;&#x5973;&#x5FC3;&#x7406;&#x5E08;&#x300B;&#x91CC;&#x8BF4;&#xFF1A;&#x201C;&#x4E00;&#x676F;&#x5496;&#x5561;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x662F;&#x6C34;&#x3002;&#x4E00;&#x676F;&#x5496;&#x5561;&#x91CC;98%&#x90FD;&#x662F;&#x6C34;&#x201D;&#x3002;&#x800C;&#x90A3;&#x4E9B;&#x7B80;&#x5355;&#x800C;&#x53C8;&#x8C8C;&#x4F3C;&#x67AF;&#x71E5;&#x7684;&#x91CD;&#x590D;&#x5C31;&#x597D;&#x50CF;&#x5496;&#x5561;&#x91CC;&#x7684;&#x6C34;&#x4E00;&#x6837;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8010;&#x5FC3;&#x90FD;&#x6765;&#x81EA;&#x4E8E;&#x4E86;&#x89E3;&#x3002;// &#x56E0;&#x4E3A;&#x4E86;&#x89E3;&#xFF0C;&#x4F60;&#x4F1A;&#x77E5;&#x9053;&#x4F60;&#x7684;&#x8D77;&#x70B9;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x4F60;&#x7684;&#x7EC8;&#x70B9;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x800C;&#x4F60;&#x6B64;&#x523B;&#x5728;&#x54EA;&#x91CC;&#x3002;&#x56E0;&#x4E3A;&#x4E86;&#x89E3;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x8010;&#x5FC3;&#x5730;&#x518D;&#x575A;&#x6301;&#x591A;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x5C31;&#x80FD;&#x53D6;&#x5F97;&#x9636;&#x6BB5;&#x6027;&#x7684;&#x80DC;&#x5229;&#x3002;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x6574;&#x88C5;&#x5F85;&#x53D1;&#xFF0C;&#x5F00;&#x59CB;&#x4E0B;&#x4E00;&#x9636;&#x6BB5;&#x7684;&#x8DEF;&#x7A0B;&#x3002;</p>
<p>&#x201C;&#x6BCF;&#x6B21;&#x6BD4;&#x8D5B;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x90FD;&#x8981;&#x4E58;&#x8F66;&#x628A;&#x6BD4;&#x8D5B;&#x7684;&#x7EBF;&#x8DEF;&#x4ED4;&#x7EC6;&#x770B;&#x4E00;&#x904D;&#xFF0C;&#x5E76;&#x628A;&#x6CBF;&#x9014;&#x6BD4;&#x8F83;&#x9192;&#x76EE;&#x7684;&#x6807;&#x5FD7;&#x753B;&#x4E0B;&#x6765;&#x3002;&#x6BD4;&#x5982;&#x7B2C;&#x4E00;&#x4E2A;&#x6807;&#x5FD7;&#x662F;&#x94F6;&#x884C;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x6807;&#x5FD7;&#x662F;&#x4E00;&#x68F5;&#x5927;&#x6811;&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x6807;&#x5FD7;&#x662F;&#x4E00;&#x5EA7;&#x7EA2;&#x623F;&#x5B50;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x76F4;&#x753B;&#x5230;&#x8D5B;&#x7A0B;&#x7684;&#x7EC8;&#x70B9;&#x3002;&#x6BD4;&#x8D5B;&#x5F00;&#x59CB;&#x540E;&#xFF0C;&#x6211;&#x5C31;&#x4EE5;&#x767E;&#x7C73;&#x51B2;&#x523A;&#x7684;&#x901F;&#x5EA6;&#x594B;&#x529B;&#x5411;&#x7B2C;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x51B2;&#x53BB;&#xFF0C;&#x7B49;&#x5230;&#x8FBE;&#x7B2C;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x6211;&#x53C8;&#x4EE5;&#x540C;&#x6837;&#x7684;&#x901F;&#x5EA6;&#x5411;&#x7B2C;&#x4E8C;&#x4E2A;&#x76EE;&#x6807;&#x51B2;&#x53BB;&#x3002;&#x56DB;&#x5341;&#x51E0;&#x516C;&#x91CC;&#x7684;&#x8D5B;&#x7A0B;&#xFF0C;&#x5C31;&#x88AB;&#x6211;&#x5206;&#x89E3;&#x6210;&#x8FD9;&#x4E48;&#x51E0;&#x4E2A;&#x5C0F;&#x76EE;&#x6807;&#x8F7B;&#x677E;&#x5730;&#x8DD1;&#x5B8C;&#x4E86;&#x3002;&#x8D77;&#x521D;&#xFF0C;&#x6211;&#x5E76;&#x4E0D;&#x61C2;&#x8FD9;&#x6837;&#x7684;&#x9053;&#x7406;&#xFF0C;&#x6211;&#x628A;&#x6211;&#x7684;&#x76EE;&#x6807;&#x5B9A;&#x5728;&#x56DB;&#x5341;&#x51E0;&#x516C;&#x91CC;&#x5904;&#x7684;&#x7EC8;&#x70B9;&#x7EBF;&#x4E0A;&#xFF0C;&#x7ED3;&#x679C;&#x6211;&#x8DD1;&#x5230;&#x5341;&#x51E0;&#x516C;&#x91CC;&#x65F6;&#x5C31;&#x75B2;&#x60EB;&#x4E0D;&#x582A;&#x4E86;&#xFF0C;&#x6211;&#x88AB;&#x524D;&#x9762;&#x90A3;&#x6BB5;&#x9065;&#x8FDC;&#x7684;&#x8DEF;&#x7A0B;&#x7ED9;&#x5413;&#x5012;&#x4E86;&#x3002;&#x201D; // &#x4E86;&#x89E3;&#x4F60;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF08;&#x5373;&#x4F7F;&#x4E0D;&#x80FD;&#x6E05;&#x695A;&#x5730;&#x4E86;&#x89E3;&#xFF0C;&#x4E5F;&#x5C3D;&#x91CF;&#x53BB;&#x5F04;&#x6E05;&#x66F4;&#x591A;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x5E76;&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x8C03;&#x6574;&#xFF09;&#xFF0C;&#x5E76;&#x5C06;&#x5927;&#x4EFB;&#x52A1;&#x5206;&#x4E3A;&#x5C0F;&#x4EFB;&#x52A1;&#x3002;&#x4EBA;&#x4EEC;&#x505A;&#x4E8B;&#x662F;&#x9700;&#x8981;&#x53CD;&#x9988;&#x7684;&#xFF0C;&#x5C0F;&#x4EFB;&#x52A1;&#x7684;&#x8FBE;&#x6210;&#x4F1A;&#x7ED9;&#x6267;&#x884C;&#x8005;&#x4EE5;&#x6B63;&#x9762;&#x53CD;&#x9988;&#xFF0C;&#x8BA9;&#x4ED6;&#x80FD;&#x4FE1;&#x5FC3;&#x6EE1;&#x6EE1;&#x5730;&#x5F00;&#x59CB;&#x4E0B;&#x4E00;&#x4E2A;&#x5C0F;&#x4EFB;&#x52A1;&#x3002;&#x5982;&#x679C;&#x957F;&#x65F6;&#x95F4;&#x6CA1;&#x6709;&#x6B63;&#x9762;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x6BC5;&#x529B;&#x518D;&#x597D;&#x4E5F;&#x5F88;&#x96BE;&#x575A;&#x6301;&#x4E0B;&#x6765;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x5B81;&#x613F;&#x6B7B;&#x4E5F;&#x4E0D;&#x613F;&#x601D;&#x8003;&#x3002;</p>
]]></content>
    <summary type="html">
    <![CDATA[<h2 id="前言">前言</h2><p>人生是马拉松，胜者不一定是跑得最快的。</p>
<p>以我个人的体会，我非常鼓励每个年轻人能花上几年时间到国外走一走，学一学。教育的根本其实只不过是“见多识广”。然后再用5到10年时间定义一个属于自己的人生方向，为之奋斗，为之坚持，不知停歇地努力上10年20年。有些成功靠运气，可是持续的成功却与运气无关。</p>
<h2 id="所有人的困境">所有人的困境</h2><h3 id="提问和回答">提问和回答</h3><p>苏格拉底提示所谓的思考过程不过是“提问和回答”。</p>
<p>我一直相信，教是最好的学习方法。事实上，在不停地为学生解释疑问的过程中，我自己学到的东西更多，而更多的程序超乎想象。</p>]]>
    
    </summary>
    
      <category term="哲文" scheme="/tags/%E5%93%B2%E6%96%87/"/>
    
  </entry>
  
  <entry>
    <title><![CDATA[git_toturial]]></title>
    <link href="/2015/07/17/git-toturial/"/>
    <id>/2015/07/17/git-toturial/</id>
    <published>2015-07-17T05:53:27.000Z</published>
    <updated>2015-07-17T06:45:01.000Z</updated>
    <content type="html"><![CDATA[<p>git&#x547D;&#x4EE4;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x6253;&#x7B97;&#x4EE5;&#x540E;&#x6BCF;&#x5468;&#x8BE6;&#x7EC6;&#x4E86;&#x89E3;&#x5176;&#x4E2D;&#x4E09;&#x4E2A;&#x547D;&#x4EE4;&#xFF0C;&#x8FD9;&#x6837;&#x4E89;&#x53D6;&#x5728;&#x4E24;&#x4E2A;&#x6708;&#x5185;&#x5C06;git&#x547D;&#x4EE4;&#x719F;&#x6089;&#xFF0C;&#x66F4;&#x52A0;&#x5FEB;&#x6377;&#x7684;&#x505A;&#x597D;&#x5DE5;&#x4F5C;</p>
<p>&#x65B0;&#x624B;&#x63A8;&#x8350;&#xFF1A;<a href="http://www.bootcss.com/p/git-guide/" target="_blank" rel="external">git-&#x7B80;&#x6613;&#x6307;&#x5357;</a></p>
<p>git init                                                  # &#x521D;&#x59CB;&#x5316;&#x672C;&#x5730;git&#x4ED3;&#x5E93;&#xFF08;&#x521B;&#x5EFA;&#x65B0;&#x4ED3;&#x5E93;&#xFF09;</p>
<p>git config &#x2014;global user.name &#x201C;xxx&#x201D;                       # &#x914D;&#x7F6E;&#x7528;&#x6237;&#x540D;</p>
<p>git config &#x2014;global user.email &#x201C;xxx@xxx.com&#x201D;    s          # &#x914D;&#x7F6E;&#x90AE;&#x4EF6;</p>
<p>git config &#x2014;global color.ui true                         # git status&#x7B49;&#x547D;&#x4EE4;&#x81EA;&#x52A8;&#x7740;&#x8272;</p>
<p>git config &#x2014;global color.status auto</p>
<p>git config &#x2014;global color.diff auto</p>
<p>git config &#x2014;global color.branch auto</p>
<p>git config &#x2014;global color.interactive auto</p>
<p>git config &#x2014;global &#x2014;unset http.proxy                    # remove  proxy configuration on git</p>
<p>git clone git+ssh://git@192.168.53.168/VT.git             # clone&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;</p>
<p>git status                                                # &#x67E5;&#x770B;&#x5F53;&#x524D;&#x7248;&#x672C;&#x72B6;&#x6001;&#xFF08;&#x662F;&#x5426;&#x4FEE;&#x6539;&#xFF09;</p>
<a id="more"></a>
<p>git add xyz                                               # &#x6DFB;&#x52A0;xyz&#x6587;&#x4EF6;&#x81F3;index</p>
<p>git add .                                                 # &#x589E;&#x52A0;&#x5F53;&#x524D;&#x5B50;&#x76EE;&#x5F55;&#x4E0B;&#x6240;&#x6709;&#x66F4;&#x6539;&#x8FC7;&#x7684;&#x6587;&#x4EF6;&#x81F3;index</p>
<p>git commit -m &#x2018;xxx&#x2019;                                       # &#x63D0;&#x4EA4;</p>
<p>git commit &#x2014;amend -m &#x2018;xxx&#x2019;                               # &#x5408;&#x5E76;&#x4E0A;&#x4E00;&#x6B21;&#x63D0;&#x4EA4;&#xFF08;&#x7528;&#x4E8E;&#x53CD;&#x590D;&#x4FEE;&#x6539;&#xFF09;</p>
<p>git commit -am &#x2018;xxx&#x2019;                                      # &#x5C06;add&#x548C;commit&#x5408;&#x4E3A;&#x4E00;&#x6B65;</p>
<p>git rm xxx                                                # &#x5220;&#x9664;index&#x4E2D;&#x7684;&#x6587;&#x4EF6;</p>
<p>git rm -r *                                               # &#x9012;&#x5F52;&#x5220;&#x9664;</p>
<p>git log                                                   # &#x663E;&#x793A;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;</p>
<p>git log -1                                                # &#x663E;&#x793A;1&#x884C;&#x65E5;&#x5FD7; -n&#x4E3A;n&#x884C;</p>
<p>git log -5</p>
<p>git log &#x2014;stat                                            # &#x663E;&#x793A;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x53CA;&#x76F8;&#x5173;&#x53D8;&#x52A8;&#x6587;&#x4EF6;</p>
<p>git log -p -m</p>
<p>git show dfb02e6e4f2f7b573337763e5c0013802e392818         # &#x663E;&#x793A;&#x67D0;&#x4E2A;&#x63D0;&#x4EA4;&#x7684;&#x8BE6;&#x7EC6;&#x5185;&#x5BB9;</p>
<p>git show dfb02                                            # &#x53EF;&#x53EA;&#x7528;commitid&#x7684;&#x524D;&#x51E0;&#x4F4D;</p>
<p>git show HEAD                                             # &#x663E;&#x793A;HEAD&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;</p>
<p>git show HEAD^                                            # &#x663E;&#x793A;HEAD&#x7684;&#x7236;&#xFF08;&#x4E0A;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#xFF09;&#x7684;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7; ^^&#x4E3A;&#x4E0A;&#x4E24;&#x4E2A;&#x7248;&#x672C; ^5&#x4E3A;&#x4E0A;5&#x4E2A;&#x7248;&#x672C;</p>
<p>git tag                                                   # &#x663E;&#x793A;&#x5DF2;&#x5B58;&#x5728;&#x7684;tag</p>
<p>git tag -a v2.0 -m &#x2018;xxx&#x2019;                                  # &#x589E;&#x52A0;v2.0&#x7684;tag</p>
<p>git show v2.0                                             # &#x663E;&#x793A;v2.0&#x7684;&#x65E5;&#x5FD7;&#x53CA;&#x8BE6;&#x7EC6;&#x5185;&#x5BB9;</p>
<p>git log v2.0                                              # &#x663E;&#x793A;v2.0&#x7684;&#x65E5;&#x5FD7;</p>
<p>git diff                                                  # &#x663E;&#x793A;&#x6240;&#x6709;&#x672A;&#x6DFB;&#x52A0;&#x81F3;index&#x7684;&#x53D8;&#x66F4;</p>
<p>git diff &#x2014;cached                                         # &#x663E;&#x793A;&#x6240;&#x6709;&#x5DF2;&#x6DFB;&#x52A0;index&#x4F46;&#x8FD8;&#x672A;commit&#x7684;&#x53D8;&#x66F4;</p>
<p>git diff HEAD^                                            # &#x6BD4;&#x8F83;&#x4E0E;&#x4E0A;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x5DEE;&#x5F02;</p>
<p>git diff HEAD &#x2014; ./lib                                    # &#x6BD4;&#x8F83;&#x4E0E;HEAD&#x7248;&#x672C;lib&#x76EE;&#x5F55;&#x7684;&#x5DEE;&#x5F02;</p>
<p>git diff origin/master..master                            # &#x6BD4;&#x8F83;&#x8FDC;&#x7A0B;&#x5206;&#x652F;master&#x4E0A;&#x6709;&#x672C;&#x5730;&#x5206;&#x652F;master&#x4E0A;&#x6CA1;&#x6709;&#x7684;</p>
<p>git diff origin/master..master &#x2014;stat                     # &#x53EA;&#x663E;&#x793A;&#x5DEE;&#x5F02;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x663E;&#x793A;&#x5177;&#x4F53;&#x5185;&#x5BB9;</p>
<p>git remote add origin git+ssh://git@192.168.53.168/VT.git # &#x589E;&#x52A0;&#x8FDC;&#x7A0B;&#x5B9A;&#x4E49;&#xFF08;&#x7528;&#x4E8E;push/pull/fetch&#xFF09;</p>
<p>git branch                                                # &#x663E;&#x793A;&#x672C;&#x5730;&#x5206;&#x652F;</p>
<p>git branch &#x2014;contains 50089                               # &#x663E;&#x793A;&#x5305;&#x542B;&#x63D0;&#x4EA4;50089&#x7684;&#x5206;&#x652F;</p>
<p>git branch -a                                             # &#x663E;&#x793A;&#x6240;&#x6709;&#x5206;&#x652F;</p>
<p>git branch -r                                             # &#x663E;&#x793A;&#x6240;&#x6709;&#x539F;&#x521B;&#x5206;&#x652F;</p>
<p>git branch &#x2014;merged                                       # &#x663E;&#x793A;&#x6240;&#x6709;&#x5DF2;&#x5408;&#x5E76;&#x5230;&#x5F53;&#x524D;&#x5206;&#x652F;&#x7684;&#x5206;&#x652F;</p>
<p>git branch &#x2014;no-merged                                    # &#x663E;&#x793A;&#x6240;&#x6709;&#x672A;&#x5408;&#x5E76;&#x5230;&#x5F53;&#x524D;&#x5206;&#x652F;&#x7684;&#x5206;&#x652F;</p>
<p>git branch -m master master_copy                          # &#x672C;&#x5730;&#x5206;&#x652F;&#x6539;&#x540D;</p>
<p>git checkout -b master_copy                               # &#x4ECE;&#x5F53;&#x524D;&#x5206;&#x652F;&#x521B;&#x5EFA;&#x65B0;&#x5206;&#x652F;master_copy&#x5E76;&#x68C0;&#x51FA;</p>
<p>git checkout -b master master_copy                        # &#x4E0A;&#x9762;&#x7684;&#x5B8C;&#x6574;&#x7248;</p>
<p>git checkout features/performance                         # &#x68C0;&#x51FA;&#x5DF2;&#x5B58;&#x5728;&#x7684;features/performance&#x5206;&#x652F;</p>
<p>git checkout &#x2014;track hotfixes/BJVEP933                    # &#x68C0;&#x51FA;&#x8FDC;&#x7A0B;&#x5206;&#x652F;hotfixes/BJVEP933&#x5E76;&#x521B;&#x5EFA;&#x672C;&#x5730;&#x8DDF;&#x8E2A;&#x5206;&#x652F;</p>
<p>git checkout v2.0                                         # &#x68C0;&#x51FA;&#x7248;&#x672C;v2.0</p>
<p>git checkout -b devel origin/develop                      # &#x4ECE;&#x8FDC;&#x7A0B;&#x5206;&#x652F;develop&#x521B;&#x5EFA;&#x65B0;&#x672C;&#x5730;&#x5206;&#x652F;devel&#x5E76;&#x68C0;&#x51FA;</p>
<p>git checkout &#x2014; README                                    # &#x68C0;&#x51FA;head&#x7248;&#x672C;&#x7684;README&#x6587;&#x4EF6;&#xFF08;&#x53EF;&#x7528;&#x4E8E;&#x4FEE;&#x6539;&#x9519;&#x8BEF;&#x56DE;&#x9000;&#xFF09;</p>
<p>git merge origin/master                                   # &#x5408;&#x5E76;&#x8FDC;&#x7A0B;master&#x5206;&#x652F;&#x81F3;&#x5F53;&#x524D;&#x5206;&#x652F;</p>
<p>git cherry-pick ff44785404a8e                             # &#x5408;&#x5E76;&#x63D0;&#x4EA4;ff44785404a8e&#x7684;&#x4FEE;&#x6539;</p>
<p>git push origin master                                    # &#x5C06;&#x5F53;&#x524D;&#x5206;&#x652F;push&#x5230;&#x8FDC;&#x7A0B;master&#x5206;&#x652F;</p>
<p>git push origin :hotfixes/BJVEP933                        # &#x5220;&#x9664;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x7684;hotfixes/BJVEP933&#x5206;&#x652F;</p>
<p>git push &#x2014;tags                                           # &#x628A;&#x6240;&#x6709;tag&#x63A8;&#x9001;&#x5230;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;</p>
<p>git fetch                                                 # &#x83B7;&#x53D6;&#x6240;&#x6709;&#x8FDC;&#x7A0B;&#x5206;&#x652F;&#xFF08;&#x4E0D;&#x66F4;&#x65B0;&#x672C;&#x5730;&#x5206;&#x652F;&#xFF0C;&#x53E6;&#x9700;merge&#xFF09;</p>
<p>git fetch &#x2014;prune                                         # &#x83B7;&#x53D6;&#x6240;&#x6709;&#x539F;&#x521B;&#x5206;&#x652F;&#x5E76;&#x6E05;&#x9664;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5DF2;&#x5220;&#x6389;&#x7684;&#x5206;&#x652F;</p>
<p>git pull origin master                                    # &#x83B7;&#x53D6;&#x8FDC;&#x7A0B;&#x5206;&#x652F;master&#x5E76;merge&#x5230;&#x5F53;&#x524D;&#x5206;&#x652F;</p>
<p>git mv README README2                                     # &#x91CD;&#x547D;&#x540D;&#x6587;&#x4EF6;README&#x4E3A;README2</p>
<p>git reset &#x2014;hard HEAD                                     # &#x5C06;&#x5F53;&#x524D;&#x7248;&#x672C;&#x91CD;&#x7F6E;&#x4E3A;HEAD&#xFF08;&#x901A;&#x5E38;&#x7528;&#x4E8E;merge&#x5931;&#x8D25;&#x56DE;&#x9000;&#xFF09;</p>
<p>git rebase</p>
<p>git branch -d hotfixes/BJVEP933                           # &#x5220;&#x9664;&#x5206;&#x652F;hotfixes/BJVEP933&#xFF08;&#x672C;&#x5206;&#x652F;&#x4FEE;&#x6539;&#x5DF2;&#x5408;&#x5E76;&#x5230;&#x5176;&#x4ED6;&#x5206;&#x652F;&#xFF09;</p>
<p>git branch -D hotfixes/BJVEP933                           # &#x5F3A;&#x5236;&#x5220;&#x9664;&#x5206;&#x652F;hotfixes/BJVEP933</p>
<p>git ls-files                                              # &#x5217;&#x51FA;git index&#x5305;&#x542B;&#x7684;&#x6587;&#x4EF6;</p>
<p>git show-branch                                           # &#x56FE;&#x793A;&#x5F53;&#x524D;&#x5206;&#x652F;&#x5386;&#x53F2;</p>
<p>git show-branch &#x2014;all                                     # &#x56FE;&#x793A;&#x6240;&#x6709;&#x5206;&#x652F;&#x5386;&#x53F2;</p>
<p>git whatchanged                                           # &#x663E;&#x793A;&#x63D0;&#x4EA4;&#x5386;&#x53F2;&#x5BF9;&#x5E94;&#x7684;&#x6587;&#x4EF6;&#x4FEE;&#x6539;</p>
<p>git revert dfb02e6e4f2f7b573337763e5c0013802e392818       # &#x64A4;&#x9500;&#x63D0;&#x4EA4;dfb02e6e4f2f7b573337763e5c0013802e392818</p>
<p>git ls-tree HEAD                                          # &#x5185;&#x90E8;&#x547D;&#x4EE4;&#xFF1A;&#x663E;&#x793A;&#x67D0;&#x4E2A;git&#x5BF9;&#x8C61;</p>
<p>git rev-parse v2.0                                        # &#x5185;&#x90E8;&#x547D;&#x4EE4;&#xFF1A;&#x663E;&#x793A;&#x67D0;&#x4E2A;ref&#x5BF9;&#x4E8E;&#x7684;SHA1 HASH</p>
<p>git reflog                                                # &#x663E;&#x793A;&#x6240;&#x6709;&#x63D0;&#x4EA4;&#xFF0C;&#x5305;&#x62EC;&#x5B64;&#x7ACB;&#x8282;&#x70B9;</p>
<p>git show HEAD@{5}</p>
<p>git show master@{yesterday}                               # &#x663E;&#x793A;master&#x5206;&#x652F;&#x6628;&#x5929;&#x7684;&#x72B6;&#x6001;</p>
<p>git log &#x2014;pretty=format:&#x2019;%h %s&#x2019; &#x2014;graph                   # &#x56FE;&#x793A;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;</p>
<p>git show HEAD~3</p>
<p>git show -s &#x2014;pretty=raw 2be7fcb476</p>
<p>git stash                                                 # &#x6682;&#x5B58;&#x5F53;&#x524D;&#x4FEE;&#x6539;&#xFF0C;&#x5C06;&#x6240;&#x6709;&#x81F3;&#x4E3A;HEAD&#x72B6;&#x6001;</p>
<p>git stash list                                            # &#x67E5;&#x770B;&#x6240;&#x6709;&#x6682;&#x5B58;</p>
<p>git stash show -p stash@{0}                               # &#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x6B21;&#x6682;&#x5B58;</p>
<p>git stash apply stash@{0}                                 # &#x5E94;&#x7528;&#x7B2C;&#x4E00;&#x6B21;&#x6682;&#x5B58;</p>
<p>git grep &#x201C;delete from&#x201D;                                    # &#x6587;&#x4EF6;&#x4E2D;&#x641C;&#x7D22;&#x6587;&#x672C;&#x201C;delete from&#x201D;</p>
<p>git grep -e &#x2018;#define&#x2019; &#x2014;and -e SORT_DIRENT</p>
<p>git gc</p>
<p>git fsck</p>
]]></content>
    <summary type="html">
    <![CDATA[<p>git命令的集合，打算以后每周详细了解其中三个命令，这样争取在两个月内将git命令熟悉，更加快捷的做好工作</p>
<p>新手推荐：<a href="http://www.bootcss.com/p/git-guide/">git-简易指南</a></p>
<p>git init                                                  # 初始化本地git仓库（创建新仓库）</p>
<p>git config —global user.name “xxx”                       # 配置用户名</p>
<p>git config —global user.email “xxx@xxx.com”    s          # 配置邮件</p>
<p>git config —global color.ui true                         # git status等命令自动着色</p>
<p>git config —global color.status auto</p>
<p>git config —global color.diff auto</p>
<p>git config —global color.branch auto</p>
<p>git config —global color.interactive auto</p>
<p>git config —global —unset http.proxy                    # remove  proxy configuration on git</p>
<p>git clone git+ssh://git@192.168.53.168/VT.git             # clone远程仓库</p>
<p>git status                                                # 查看当前版本状态（是否修改）</p>]]>
    
    </summary>
    
      <category term="git" scheme="/tags/git/"/>
    
      <category term="tools" scheme="/tags/tools/"/>
    
  </entry>
  
  <entry>
    <title><![CDATA[【转】NotSOperation]]></title>
    <link href="/2015/07/08/NSOperation/"/>
    <id>/2015/07/08/NSOperation/</id>
    <published>2015-07-08T10:36:44.000Z</published>
    <updated>2015-07-15T01:54:45.000Z</updated>
    <content type="html"><![CDATA[<p><a href="http://my.oschina.net/hmj/blog/135629#OSC_h3_4" target="_blank" rel="external">&#x535A;&#x5BA2;&#x539F;&#x6587;</a></p>
<p>Cocoa operations&#x4EE5;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x5F62;&#x5F0F;&#x5C01;&#x88C5;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#xFF0C;&#x63D0;&#x4F9B;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x673A;&#x5236;&#x3002;Operations&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0E;Operation Queue&#x534F;&#x540C;&#x8FD0;&#x884C;&#x3002;OS X&#x548C;IOS&#x4E2D;Cocoa&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5927;&#x591A;&#x8FD0;&#x7528;&#x4E86;operation&#x673A;&#x5236;&#x3002;Operations&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x7A0B;&#x5E8F;&#x7684;&#x5E76;&#x53D1;&#x5904;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x884C;&#x4E3A;&#x6216;&#x5904;&#x7406;&#x903B;&#x8F91;&#x5C01;&#x88C5;&#x8FDB;&#x72EC;&#x7ACB;&#x7684;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#xFF0C;&#x51CF;&#x5C11;&#x5E94;&#x7528;&#x4E3B;&#x7EBF;&#x7A0B;&#x7684;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x63D0;&#x4F9B;&#x6D41;&#x7545;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x3002;</p>
<p>Operation&#x5BF9;&#x8C61;&#x662F;NSOperation&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x7528;&#x4EE5;&#x5C01;&#x88C5;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x4E2D;&#x72EC;&#x7ACB;&#x7684;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#x3002;NSOperation&#x7C7B;&#x4E3A;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x5B9A;&#x4E49;&#x5E76;&#x63D0;&#x4F9B;&#x4E86;&#x5B50;&#x7C7B;&#x6240;&#x9700;&#x7684;&#x5173;&#x952E;&#x65B9;&#x6CD5;&#x548C;&#x57FA;&#x7840;&#x67B6;&#x6784;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x9700;&#x6C42;&#xFF0C;&#x7EE7;&#x627F;&#x5E76;&#x5B9E;&#x73B0;NSOperation&#x7C7B;&#x7684;&#x5B50;&#x7C7B;&#xFF0C;&#x6765;&#x5904;&#x7406;&#x81EA;&#x5DF1;&#x7684;&#x7A0B;&#x5E8F;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#x3002;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7C7B;&#x7684;&#x6570;&#x91CF;&#x548C;&#x590D;&#x6742;&#x6027;&#xFF0C;Foundation&#x6846;&#x67B6;&#x63D0;&#x4F9B;&#x4E86;&#x4E24;&#x4E2A;NSOperation&#x7684;&#x5177;&#x4F53;&#x5B50;&#x7C7B;&#x4EE5;&#x4F9B;&#x4F7F;&#x7528;&#xFF1A;</p>
<a id="more"></a>
<!-- toc -->
<ul>
<li><a href="#nsinvocationoperation">NSInvocationOperation</a></li>
<li><a href="#nsblockoperation">NSBlockOperation</a></li>
<li><a href="#&#x81EA;&#x5B9A;&#x4E49;operation&#x5BF9;&#x8C61;">&#x81EA;&#x5B9A;&#x4E49;Operation&#x5BF9;&#x8C61;</a></li>
<li><a href="#&#x6B63;&#x786E;&#x5730;&#x54CD;&#x5E94;cancel&#x4E8B;&#x4EF6;">&#x6B63;&#x786E;&#x5730;&#x54CD;&#x5E94;Cancel&#x4E8B;&#x4EF6;</a></li>
<li><a href="#&#x7EF4;&#x62A4;nsoperation&#x7684;kvo&#x517C;&#x5BB9;&#x6027;">&#x7EF4;&#x62A4;NSOperation&#x7684;KVO&#x517C;&#x5BB9;&#x6027;</a></li>
<li><a href="#&#x914D;&#x7F6E;operation&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;">&#x914D;&#x7F6E;Operation&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;</a></li>
<li><a href="#&#x6DFB;&#x52A0;completion-block">&#x6DFB;&#x52A0;Completion Block</a></li>
<li><a href="#operation&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;">Operation&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;</a></li>
<li><a href="#&#x51B3;&#x5B9A;operation&#x5BF9;&#x8C61;&#x7684;&#x5408;&#x9002;&#x7684;&#x4F7F;&#x7528;&#x8303;&#x56F4;">&#x51B3;&#x5B9A;Operation&#x5BF9;&#x8C61;&#x7684;&#x5408;&#x9002;&#x7684;&#x4F7F;&#x7528;&#x8303;&#x56F4;</a></li>
<li><a href="#&#x6267;&#x884C;operation">&#x6267;&#x884C;Operation</a></li>
<li><a href="#&#x53D6;&#x6D88;operation">&#x53D6;&#x6D88;Operation</a></li>
<li><a href="#&#x7B49;&#x5F85;operation&#x7ED3;&#x675F;">&#x7B49;&#x5F85;Operation&#x7ED3;&#x675F;</a></li>
<li><a href="#&#x6302;&#x8D77;&#x548C;&#x6062;&#x590D;&#x961F;&#x5217;">&#x6302;&#x8D77;&#x548C;&#x6062;&#x590D;&#x961F;&#x5217;</a></li>
</ul>
<!-- tocstop -->
<h3 id="nsinvocationoperation">NSInvocationOperation</h3><p>&#x521B;&#x5EFA;NSInvocationOperation&#x5BF9;&#x8C61;&#xFF0C;&#x63D0;&#x4F9B;&#x7528;&#x4EE5;&#x8C03;&#x7528;&#x7684;&#x6307;&#x5B9A;&#x5BF9;&#x8C61;&#x7684;&#x4EE5;&#x53CA;&#x8BE5;&#x5BF9;&#x8C61;&#x7279;&#x5B9A;&#x65B9;&#x6CD5;&#x7684;selector&#x3002;</p>
<figure class="highlight objectivec"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">@implementation</span> <span class="title">AppCustomClass</span></span></span><br><span class="line">- (<span class="built_in">NSOperation</span>*)createInvocationOperation:(<span class="keyword">id</span>)params</span><br><span class="line">{</span><br><span class="line">    <span class="built_in">NSInvocationOperation</span>* operation = [[<span class="built_in">NSInvocationOperation</span> alloc] initWithTarget:<span class="keyword">self</span></span><br><span class="line">                selector:<span class="keyword">@selector</span>(customTaskMethod:)</span><br><span class="line">                object:params];</span><br><span class="line"></span><br><span class="line">     <span class="keyword">return</span> operation;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line"><span class="comment">// &#x5B9E;&#x9645;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x5DE5;&#x4F5C;&#x5355;&#x5143;</span></span><br><span class="line">- (<span class="keyword">void</span>)customTaskMethod:(<span class="keyword">id</span>)params</span><br><span class="line">{</span><br><span class="line">    <span class="comment">// to do the task.</span></span><br><span class="line">}</span><br><span class="line"></span><br><span class="line"><span class="keyword">@end</span></span><br></pre></td></tr></table></figure>
<h3 id="nsblockoperation">NSBlockOperation</h3><p>&#x4E0E;NSInvocationOperation&#x4E00;&#x6837;&#x540C;&#x5C5E;NSOperation&#x7684;&#x5177;&#x4F53;&#x5B50;&#x7C7B;&#xFF0C;&#x4F46;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x4EE5;block&#x7684;&#x5F62;&#x5F0F;&#x5BF9;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x5C01;&#x88C5;,&#x4F46;block&#x672C;&#x8EAB;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x663E;&#x793A;&#x7684;&#x4F20;&#x5165;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3002;</p>
<figure class="highlight objectivec"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"></span><br><span class="line"><span class="built_in">NSBlockOperation</span>* blockOperation = [<span class="built_in">NSBlockOperation</span> blockOperationWithBlock: ^{</span><br><span class="line">    <span class="comment">// to do the task.</span></span><br><span class="line">}];</span><br></pre></td></tr></table></figure>
<p>&#x5728;&#x521B;&#x5EFA;blockOperation&#x540E;&#x53EF;&#x4EE5;&#x8C03;&#x7528;addExecutionBlock:&#x65B9;&#x6CD5;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x7684;block</p>
<h3 id="&#x81EA;&#x5B9A;&#x4E49;operation&#x5BF9;&#x8C61;">&#x81EA;&#x5B9A;&#x4E49;Operation&#x5BF9;&#x8C61;</h3><p>NSInvocationOperation&#x548C;NSBlockOperation&#x5E76;&#x4E0D;&#x4F1A;&#x6EE1;&#x8DB3;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6240;&#x6709;&#x9700;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x76F4;&#x63A5;&#x7EE7;&#x627F;NSOperation&#x6765;&#x6DFB;&#x52A0;&#x6240;&#x9700;&#x7684;&#x5904;&#x7406;&#x903B;&#x8F91;&#x3002;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;NSOperation&#x63D0;&#x4F9B;&#x4E86;&#x5B50;&#x7C7B;&#x901A;&#x7528;&#x7684;&#x6A21;&#x677F;&#x65B9;&#x6CD5;&#xFF0C;&#x6765;&#x5904;&#x7406;operation&#x95F4;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x548C;&#x4FDD;&#x8BC1;KVO&#x517C;&#x5BB9;&#x6027;&#x3002;&#x5B9E;&#x73B0;&#x975E;&#x5E76;&#x53D1;&#x578B;&#x7684;operation&#x53EA;&#x8981;&#x5B9E;&#x73B0;main task&#x5E76;&#x6B63;&#x786E;&#x54CD;&#x5E94;&#x53D6;&#x6D88;&#x4E8B;&#x4EF6;&#x5373;&#x53EF;&#x3002;&#x5E76;&#x53D1;&#x578B;&#x7684;operation&#x5219;&#x7A0D;&#x5FAE;&#x590D;&#x6742;&#x70B9;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x66FF;&#x6362;NSOperation&#x5DF2;&#x6709;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x81EA;&#x5B9A;&#x4E49;NSOperation&#x7684;&#x6700;&#x5C0F;&#x64CD;&#x4F5C;&#x5305;&#x62EC;&#xFF1A;</p>
<ol>
<li>&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x6267;&#x884C;operation&#x4E4B;&#x524D;&#x63D0;&#x4F9B;&#x521D;&#x59CB;&#x5316;&#x6D41;&#x7A0B;&#xFF0C;&#x51C6;&#x5907;operation&#x7684;&#x72B6;&#x6001;&#x3002;</li>
<li>&#x8986;&#x76D6;main&#x65B9;&#x6CD5;&#xFF0C;&#x5B9E;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x5904;&#x7406;&#x903B;&#x8F91;&#x3002;</li>
</ol>
<p>&#x6B64;&#x5916;&#xFF0C;&#x81EA;&#x5B9A;&#x4E49;&#x7684;NSOperation&#x5B50;&#x7C7B;&#x53EF;&#x80FD;&#x8FD8;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5305;&#x62EC;</p>
<ol>
<li>&#x63D0;&#x4F9B;&#x5728;main&#x65B9;&#x6CD5;&#x4E2D;&#x9700;&#x8981;&#x8C03;&#x7528;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x65B9;&#x6CD5;</li>
<li>&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x548C;operation&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x5B58;&#x53D6;&#x5668;&#x65B9;&#x6CD5;</li>
<li>&#x5B9E;&#x73B0;NSCoding&#x534F;&#x8BAE;&#xFF0C;&#x6DFB;&#x52A0;&#x5BF9;operation&#x5BF9;&#x8C61;&#x7684;&#x5E8F;&#x5217;&#x5316;&#x652F;&#x6301;&#x3002;</li>
</ol>
<p>&#x81EA;&#x5B9A;&#x4E49;NSOperation&#x5B50;&#x7C7B;&#x7684;&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x7801;&#x6A21;&#x677F;&#x5982;&#x4E0B;</p>
<figure class="highlight objectivec"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br></pre></td><td class="code"><pre><span class="line"></span><br><span class="line"><span class="comment">// MoveFileOperation.h</span></span><br><span class="line"><span class="class"><span class="keyword">@interface</span> <span class="title">MoveFileOperation</span> : <span class="title">NSOperation</span></span></span><br><span class="line"></span><br><span class="line">- (<span class="keyword">id</span>)initWithSrcURL:(<span class="built_in">NSURL</span> *)srcURL toDestinationURL:(<span class="built_in">NSURL</span>*)desURL;</span><br><span class="line"></span><br><span class="line"><span class="keyword">@end</span></span><br><span class="line"></span><br><span class="line"><span class="comment">// MoveFileOperation.m</span></span><br><span class="line"><span class="class"><span class="keyword">@interface</span> <span class="title">MoveFileOperation</span> ()</span></span><br><span class="line"></span><br><span class="line"><span class="keyword">@property</span> (retain) <span class="built_in">NSURL</span> *srcURL;</span><br><span class="line"></span><br><span class="line"><span class="keyword">@property</span> (retain) <span class="built_in">NSURL</span> *desURL;</span><br><span class="line"></span><br><span class="line"><span class="keyword">@end</span></span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">@implementation</span> <span class="title">MoveFileOperation</span></span></span><br><span class="line"></span><br><span class="line"><span class="keyword">@synthesize</span> rootURL, queue;</span><br><span class="line"></span><br><span class="line">- (<span class="keyword">id</span>)initWithSrcURL:(<span class="built_in">NSURL</span> *)srcURL toDestinationURL:(<span class="built_in">NSURL</span>*)desURL;</span><br><span class="line">{</span><br><span class="line">    <span class="keyword">self</span> = [<span class="keyword">super</span> init];</span><br><span class="line">    <span class="keyword">if</span> (<span class="keyword">self</span>) {</span><br><span class="line">        <span class="keyword">self</span><span class="variable">.srcURL</span> = srcURL;</span><br><span class="line">        <span class="keyword">self</span><span class="variable">.desURL</span> = desURL;</span><br><span class="line">    }</span><br><span class="line">    <span class="keyword">return</span> <span class="keyword">self</span>;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">- (<span class="keyword">void</span>)main</span><br><span class="line">{</span><br><span class="line">    <span class="keyword">if</span> ([<span class="keyword">self</span> isCancelled]){</span><br><span class="line">        <span class="keyword">return</span>;</span><br><span class="line">    }</span><br><span class="line">    <span class="built_in">NSDirectoryEnumerator</span> *itr =</span><br><span class="line">    [[<span class="built_in">NSFileManager</span> defaultManager] enumeratorAtURL:<span class="keyword">self</span><span class="variable">.srcURL</span></span><br><span class="line">                         includingPropertiesForKeys:<span class="literal">nil</span><span class="built_in">NSDirectoryEnumerationSkipsPackageDescendants</span>)</span><br><span class="line">                                       errorHandler:<span class="literal">nil</span>];</span><br><span class="line">    <span class="built_in">NSError</span> *error = [<span class="built_in">NSError</span> new];</span><br><span class="line">    <span class="keyword">for</span> (<span class="built_in">NSURL</span> *url <span class="keyword">in</span> itr) {</span><br><span class="line">        <span class="keyword">if</span> ([<span class="keyword">self</span> isCancelled]) {</span><br><span class="line">            <span class="keyword">break</span>;  </span><br><span class="line">        }<span class="keyword">else</span>{</span><br><span class="line">            <span class="built_in">NSString</span> *fileName = [url lastPathComponent];</span><br><span class="line">            <span class="built_in">NSURL</span> *desFileURL = [<span class="keyword">self</span><span class="variable">.desURL</span> URLByAppendingPathComponent:fileName];</span><br><span class="line">            [[<span class="built_in">NSFileManager</span> defaultManager] copyItemAtURL:url toURL:desFileURL  error:&amp;error];</span><br><span class="line">        }</span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<h3 id="&#x6B63;&#x786E;&#x5730;&#x54CD;&#x5E94;cancel&#x4E8B;&#x4EF6;">&#x6B63;&#x786E;&#x5730;&#x54CD;&#x5E94;Cancel&#x4E8B;&#x4EF6;</h3><p>&#x52A0;&#x5165;&#x5230;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x7684;operation&#x5BF9;&#x8C61;&#x4F1A;&#x4E00;&#x76F4;&#x8FD0;&#x884C;&#x4E0B;&#x53BB;&#xFF0C;&#x76F4;&#x81F3;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x6216;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x663E;&#x793A;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x53D6;&#x6D88;&#x64CD;&#x4F5C;&#x3002;&#x53D6;&#x6D88;operation&#x7684;&#x884C;&#x4E3A;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x5728;&#x4EFB;&#x610F;&#x65F6;&#x523B;&#xFF0C;</p>
<p>&#x5373;&#x4F7F;&#x662F;&#x5728;operation&#x5F00;&#x59CB;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x3002;NSOperation&#x7C7B;&#x63D0;&#x4F9B;&#x4E86;&#x53D6;&#x6D88;operation&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x53D6;&#x6D88;&#x884C;&#x4E3A;&#x7684;&#x5904;&#x7406;&#x9700;&#x8981;&#x7A0B;&#x5E8F;&#x81EA;&#x5DF1;&#x53BB;&#x63A7;&#x5236;&#xFF0C;&#x5982;&#x679C;operation&#x88AB;&#x76F4;&#x63A5;&#x53D6;&#x6D88;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x80FD;&#x5C31;&#x65E0;&#x6CD5;&#x6B63;&#x786E;&#x7684;&#x91CA;&#x653E;&#x4E4B;&#x524D;&#x5206;&#x914D;&#x7684;&#x4E00;&#x4E9B;&#x8D44;&#x6E90;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD0;&#x884C;&#x4E2D;&#x7684;operation&#x5728;&#x53D6;&#x6D88;&#x65F6;&#xFF0C;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x4EE5;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x5F0F;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#x5E76;&#x9000;&#x51FA;&#x3002;</p>
<p>&#x53EA;&#x8981;&#x5728;operation&#x8FD0;&#x884C;&#x4E2D;&#x5B9A;&#x671F;&#x7684;&#x5728;&#x5408;&#x9002;&#x7684;&#x4F4D;&#x7F6E;&#x8C03;&#x7528;isCancelled&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x5728;&#x5F53;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;YES&#x65F6;&#x76F4;&#x63A5;return&#x5373;&#x53EF;&#x3002;&#x53EF;&#x4EE5;&#x6B64;&#x6765;&#x652F;&#x6301;operation&#x7684;&#x53D6;&#x6D88;&#x884C;&#x4E3A;&#x3002;&#x652F;&#x6301;operation&#x5BF9;&#x8C61;&#x7684;&#x53D6;&#x6D88;&#x884C;&#x4E3A;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4E0D;&#x7BA1;operation&#x5BF9;&#x8C61;&#x6240;&#x5C5E;&#x7C7B;&#x662F;NSOperation&#x7684;&#x5177;&#x4F53;&#x5B50;&#x7C7B;&#x8FD8;&#x662F;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x3002;isCancelled&#x65B9;&#x6CD5;&#x672C;&#x8EAB;&#x662F;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#xFF0C;&#x8C03;&#x7528;&#x672C;&#x8EAB;&#x4E0D;&#x4F1A;&#x5E26;&#x6765;&#x4EFB;&#x4F55;&#x6027;&#x80FD;&#x5F71;&#x54CD;&#x3002;&#x5728;&#x7A0B;&#x5E8F;&#x903B;&#x8F91;&#x4E2D;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x6B63;&#x786E;&#x8C03;&#x7528;isCancelled&#x7684;&#x4F4D;&#x7F6E;&#x5305;&#x62EC;&#xFF1A;</p>
<p>&#x5728;&#x5B9E;&#x9645;&#x6267;&#x884C;&#x5DE5;&#x4F5C;&#x4E4B;&#x524D;<br>&#x5728;&#x6BCF;&#x4E2A;&#x5FAA;&#x73AF;&#x7684;&#x6267;&#x884C;&#x4F53;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x6B21;&#x6267;&#x884C;&#x4F53;&#x8017;&#x65F6;&#x5F88;&#x957F;&#x53EF;&#x914C;&#x60C5;&#x6DFB;&#x52A0;&#x8C03;&#x7528;&#x6B21;&#x6570;<br>&#x7A0B;&#x5E8F;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x7EC8;&#x6B62;&#x7684;&#x4EE3;&#x7801;&#x5904;&#x3002;<br>&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<figure class="highlight objectivec"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line"></span><br><span class="line">- (<span class="keyword">void</span>)main</span><br><span class="line">{</span><br><span class="line">    <span class="built_in">BOOL</span> isDone = <span class="literal">NO</span>;</span><br><span class="line">    <span class="keyword">while</span> (![<span class="keyword">self</span> isCancelled] &amp;&amp; !isDone) {</span><br><span class="line">        ....</span><br><span class="line">        <span class="keyword">if</span>([<span class="keyword">self</span> isCancelled]){</span><br><span class="line">            <span class="keyword">return</span> ;</span><br><span class="line">        }</span><br><span class="line">        ...</span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<h3 id="&#x7EF4;&#x62A4;nsoperation&#x7684;kvo&#x517C;&#x5BB9;&#x6027;">&#x7EF4;&#x62A4;NSOperation&#x7684;KVO&#x517C;&#x5BB9;&#x6027;</h3><p>NSOperation&#x7EF4;&#x62A4;&#x4EE5;&#x4E0B;key&#x7684;KVO&#x517C;&#x5BB9;&#x6027;</p>
<ul>
<li>isCancelled</li>
<li>isConcurrent</li>
<li>isExecuting</li>
<li>isFinished</li>
<li>isReady</li>
<li>dependencies</li>
<li>queuePriority</li>
<li>completionBlock</li>
</ul>
<p>&#x8986;&#x76D6;&#x4E86;start&#x65B9;&#x6CD5;&#x7684;&#x5B50;&#x7C7B;&#x9700;&#x8981;&#x7EF4;&#x62A4;isConcurrent&#xFF0C;isExecuting&#x7684;KVO&#x517C;&#x5BB9;&#x6027;<br>&#x6CA1;&#x6709;&#x8986;&#x76D6; addDependency: &#x6216; removeDependency:&#x65B9;&#x6CD5;&#x7684;&#x5B50;&#x7C7B;&#xFF0C;&#x4E0D;&#x7528;&#x5173;&#x7CFB;dependencies&#x7684;KVO&#x517C;&#x5BB9;&#x6027;<br>&#x57FA;&#x672C;&#x4E0A;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x6765;&#x663E;&#x793A;&#x7684;&#x751F;&#x6210;&#x5176;&#x5B83;&#x5C5E;&#x6027;&#x7684;KVO&#x901A;&#x77E5;&#x3002;</p>
<h3 id="&#x914D;&#x7F6E;operation&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;">&#x914D;&#x7F6E;Operation&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;</h3><p>&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x4FDD;&#x8BC1;&#x4E0D;&#x540C;&#x7684;operation&#x4EE5;&#x4E32;&#x884C;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x3002;&#x4F9D;&#x8D56;&#x4E8E;&#x5176;&#x5B83;operation&#x6267;&#x884C;&#x7ED3;&#x679C;&#x7684;operation&#x5BF9;&#x8C61;&#xFF0C;&#x53EA;&#x6709;&#x7B49;&#x5F85;&#x5B83;&#x4EEC;&#x90FD;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x6267;&#x884C;&#x3002;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x521B;&#x5EFA;&#x590D;&#x6742;&#x7684;operation&#x5BF9;&#x8C61;&#x4F9D;&#x8D56;&#x56FE;&#x3002;</p>
<p>&#x8C03;&#x7528;addDependency: &#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x4E24;&#x4E2A;operation&#x5BF9;&#x8C61;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x4E86;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x5230;&#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x5355;&#x5411;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x8FD9;&#x4E2A;&#x5355;&#x5411;&#x5173;&#x7CFB;&#x8868;&#x660E;&#x5F53;&#x524D;operation&#x5BF9;&#x8C61;&#x53EA;&#x6709;&#x5728;&#x76EE;&#x6807;operation&#x5BF9;&#x8C61;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x6267;&#x884C;&#x3002;operation&#x5BF9;&#x8C61;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x4E0D;&#x9650;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x3002;&#x6709;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;operation&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x4E2D;&#x3002;&#x4F46;&#x662F;operation&#x4E4B;&#x95F4;&#x4E0D;&#x80FD;&#x6DFB;&#x52A0;&#x5FAA;&#x73AF;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;</p>
<p>operation&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x5EFA;&#x7ACB;&#x5728;operation&#x5BF9;&#x8C61;&#x95F4;KVO&#x6D88;&#x606F;&#x7684;&#x53D1;&#x9001;&#x3002;&#x81EA;&#x5B9A;&#x4E49;&#x7684;operation&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x5728;&#x81EA;&#x5B9A;&#x4E49;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x5408;&#x9002;&#x4F4D;&#x7F6E;&#x6765;&#x6DFB;&#x52A0;KVO&#x901A;&#x77E5;&#x3002;</p>
<h3 id="&#x6DFB;&#x52A0;completion-block">&#x6DFB;&#x52A0;Completion Block</h3><p>&#x5728;OS X v10.6&#x53CA;&#x4EE5;&#x540E;&#xFF0C;operation&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x540E;&#x6267;&#x884C;&#x4E00;&#x4E2A;completion block&#x3002;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;block&#x4E2D;&#x6267;&#x884C;main task&#x4E4B;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x6B64;&#x5904;&#x6D3E;&#x53D1;operation&#x5B8C;&#x6210;&#x7684;&#x6D88;&#x606F;&#x3002;&#x5E76;&#x53D1;&#x7684;operation&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BE5;block&#x6765;&#x751F;&#x6210;&#x6700;&#x7EC8;&#x7684;KVO&#x901A;&#x77E5;&#x3002;<br>&#x901A;&#x8FC7;setCompletionBlock: &#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x6DFB;&#x52A0;completion block&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<h3 id="operation&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;">Operation&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;</h3><ol>
<li><p>&#x907F;&#x514D;&#x5355;&#x72EC;&#x7684;&#x7EBF;&#x7A0B;&#x5B58;&#x50A8;&#xFF08;Per-Thread Storage&#xFF09;<br>&#x591A;&#x6570;&#x7684;operation&#x5BF9;&#x8C61;&#x90FD;&#x8FD0;&#x884C;&#x5728;&#x7531;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x63D0;&#x4F9B;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF0C;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x8BE5;&#x7EBF;&#x7A0B;&#x7684;&#x6240;&#x6709;&#x8005;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x7EBF;&#x7A0B;&#x5BF9;&#x4E8E;operation&#x5BF9;&#x8C61;&#x5E94;&#x8BE5;&#x662F;&#x900F;&#x660E;&#x7684;&#x3002;&#x4E0D;&#x8981;&#x5C06;&#x6570;&#x636E;&#x5173;&#x8054;&#x5230;&#x90A3;&#x4E9B;&#x975E;&#x81EA;&#x5DF1;&#x521B;&#x5EFA;&#x548C;&#x6301;&#x6709;&#x7684;&#x7EBF;&#x7A0B;&#x5BF9;&#x8C61;&#x4E0A;&#x3002;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x7BA1;&#x7406;&#x7684;&#x7EBF;&#x7A0B;&#x7684;&#x521B;&#x5EFA;&#x548C;&#x91CA;&#x653E;&#x4F9D;&#x8D56;&#x4E8E;&#x7CFB;&#x7EDF;&#x548C;&#x5E94;&#x7528;&#x7684;&#x9700;&#x6C42;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x8FC7;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5BF9;&#x8C61;&#x4E0A;&#x5B58;&#x50A8;&#x88AB;&#x6240;&#x6709;operation&#x5171;&#x7528;&#x7684;&#x5171;&#x4EAB;&#x6570;&#x636E;&#xFF08;Per-Thread storage&#xFF09;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x5931;&#x8D25;&#x3002;<br>&#x6B64;&#x5916;&#xFF0C;&#x5176;&#x5B83;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x4E0D;&#x8981;&#x4F7F;&#x7528;Per-Thread storage&#x3002;&#x521D;&#x59CB;&#x5316;operation&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x5176;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5E94;&#x8BE5;<br>&#x662F;operation&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#x63D0;&#x4F9B;&#x4E86;&#x6267;&#x884C;&#x73AF;&#x5883;&#x4E0A;&#x4E0B;&#x6587;&#x6240;&#x9700;&#x7684;&#x6570;&#x636E;&#x3002;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x5E94;&#x8BE5;&#x5B58;&#x50A8;&#x5728;operation&#x5BF9;&#x8C61;&#x4E0A;&#xFF0C;&#x76F4;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x672C;&#x8EAB;&#x4F7F;&#x7528;&#x5B8C;&#x6BD5;&#x4E3A;&#x6B62;&#x3002;</p>
</li>
<li><p>&#x6309;&#x9700;&#x4FDD;&#x5B58;&#x6307;&#x5411;operation&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;<br>&#x56E0;&#x4E3A;operation&#x5BF9;&#x8C61;&#x662F;&#x4EE5;&#x5F02;&#x6B65;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4E0D;&#x80FD;&#x5728;&#x521B;&#x5EFA;&#x5B8C;operation&#x5BF9;&#x8C61;&#x4E4B;&#x540E;&#x5C31;&#x5BF9;&#x5B83;&#x7F6E;&#x4E4B;&#x4E0D;&#x7406;&#x3002;&#x5B83;&#x4EEC;&#x548C;&#x666E;&#x901A;&#x5BF9;&#x8C61;&#x4E00;&#x6837;&#x9700;&#x8981;&#x4F60;&#x6765;&#x7BA1;&#x7406;&#x6307;&#x5411;&#x5B83;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x4EE5;&#x6B64;&#x6765;&#x652F;&#x6301;&#x5176;&#x5B83;&#x4EE3;&#x7801;&#x7684;&#x8FD0;&#x884C;&#x3002;&#x5C24;&#x5176;&#x662F;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x4ECE;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x7684;operation&#x5BF9;&#x8C61;&#x4E0A;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x3002;</p>
</li>
<li><p>&#x7EF4;&#x62A4;operation&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x7684;&#x539F;&#x56E0;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;operation&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x5230;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x5728;&#x91CD;&#x65B0;&#x83B7;&#x5F97;operation&#x5BF9;&#x8C61;&#x3002;&#x64CD;&#x4F5C;&#x961F;&#x5217; &#x4F1A;&#x4EE5;&#x6700;&#x5FEB;&#x7684;&#x901F;&#x5EA6;&#x7684;&#x6D3E;&#x53D1;&#x548C;&#x6267;&#x884C;operation&#x3002;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#xFF0C;operation&#x5BF9;&#x8C61;&#x5728;&#x6DFB;&#x52A0;&#x5230;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x4E4B;&#x540E;&#x4F1A;&#x9A6C;&#x4E0A;&#x8FD0;&#x884C;&#x3002;&#x5F53;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x5411;&#x64CD;&#x4F5C; &#x961F;&#x5217;&#x83B7;&#x53D6;&#x4E4B;&#x524D;&#x6DFB;&#x52A0;&#x7684;operation&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x5DF2;&#x8FD0;&#x884C;&#x5B8C;&#x6BD5;&#x5E76;&#x4ECE;&#x961F;&#x5217;&#x4E2D;&#x79FB;&#x9664;&#xFF0C;&#x4EA6;&#x5373;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x7684;operation&#x5BF9;&#x8C61;&#x4F1A;&#x9A6C;&#x4E0A;&#x88AB;&#x91CA;&#x653E;&#x6389;&#x3002;</p>
</li>
<li><p>&#x5904;&#x7406;&#x9519;&#x8BEF;&#x548C;&#x5F02;&#x5E38;<br>&#x4EE5;&#x72EC;&#x7ACB;&#x5B9E;&#x4F53;&#x5B58;&#x5728;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;operation&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x5904;&#x7406;&#x4EFB;&#x4F55;&#x9519;&#x8BEF;&#x548C;&#x5F02;&#x5E38;&#x3002; OS X v10.6&#x53CA;&#x4EE5;&#x540E;&#x7684;&#x7248;&#x672C;&#x4E2D;&#xFF0C;NSOperation&#x7C7B;&#x63D0;&#x4F9B; &#x7684;start&#x65B9;&#x6CD5;&#x4E0D;&#x4F1A;&#x6355;&#x83B7;&#x5F02;&#x5E38;&#x3002;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x6355;&#x83B7;&#x548C;&#x6291;&#x5236;&#x5F02;&#x5E38;&#xFF0C;&#x5E76;&#x6309;&#x9700;&#x901A;&#x77E5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7684;&#x5176;&#x5B83;&#x90E8;&#x5206;&#x3002;<br>&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x786E;&#x5B9E;&#x9047;&#x5230;&#x4E86;&#x5F02;&#x5E38;&#x548C;&#x9519;&#x8BEF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x91C7;&#x53D6;&#x4EFB;&#x4F55;&#x63AA;&#x65BD;&#xFF0C;&#x4FDD;&#x8BC1;&#x9519;&#x8BEF;&#x4E0D;&#x4F1A;&#x4F20;&#x64AD;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;NSOperation&#x7C7B;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x663E;&#x793A;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5904;&#x7406; &#x9519;&#x8BEF;&#x7ED3;&#x679C;&#x4EE3;&#x7801;&#x6216;&#x5F02;&#x5E38;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x7ED9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5BF9;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x63D0;&#x4F9B;&#x6240;&#x9700;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
</li>
</ol>
<h3 id="&#x51B3;&#x5B9A;operation&#x5BF9;&#x8C61;&#x7684;&#x5408;&#x9002;&#x7684;&#x4F7F;&#x7528;&#x8303;&#x56F4;">&#x51B3;&#x5B9A;Operation&#x5BF9;&#x8C61;&#x7684;&#x5408;&#x9002;&#x7684;&#x4F7F;&#x7528;&#x8303;&#x56F4;</h3><p>&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x5411;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x4E2D;&#x6DFB;&#x52A0;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;operation&#x5BF9;&#x8C61;&#xFF0C;&#x4F46;&#x8FD9;&#x4E48;&#x505A;&#x5176;&#x5B9E;&#x662F;&#x4E0D;&#x73B0;&#x5B9E;&#x7684;&#x3002;&#x5982;&#x5176;&#x5B83;&#x5BF9;&#x8C61;&#x4E00;&#x6837;&#xFF0C;NSoperation&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x4E5F;&#x662F;&#x8981;&#x6D88;&#x8017;&#x5185;&#x5B58;&#xFF0C;&#x5E76;&#x6267;&#x884C;&#x4E5F;&#x4F1A;&#x8017;&#x65F6;&#x3002;&#x521B;&#x5EFA;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;&#x5B8C;&#x6210;&#x5C0F;&#x529F;&#x80FD;&#x7684;operation&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x8FC7;&#x5EA6;&#x6D3E;&#x53D1;&#x548C;&#x6267;&#x884C;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x8D85;&#x51FA;&#x4EFB;&#x52A1;&#x672C;&#x8EAB;&#x6240;&#x9700;&#x6D88;&#x8017;&#x7684;&#x4E0D;&#x826F;&#x7ED3;&#x679C;&#x3002;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x672C;&#x8EAB;&#x7684;&#x5185;&#x5B58;&#x7528;&#x91CF;&#x5DF2;&#x5F88;&#x7D27;&#x4FCF;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;operation&#x5BF9;&#x8C61;&#x4F1A;&#x8FDB;&#x4E00;&#x6B65;&#x964D;&#x4F4E;&#x4F60;&#x5E94;&#x7528;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x4F7F;&#x7528;operation&#x5BF9;&#x8C61;&#x7684;&#x5173;&#x952E;&#x5728;&#x4E8E;&#xFF0C;&#x5728;&#x4EFB;&#x52A1;&#x5DE5;&#x4F5C;&#x91CF;&#x4E0E;&#x4FDD;&#x8BC1;&#x8BA1;&#x7B97;&#x673A;&#x65F6;&#x523B;&#x5904;&#x4E8E;&#x7E41;&#x5FD9;&#x72B6;&#x6001;&#x4E4B;&#x95F4;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x5E73;&#x8861;&#x70B9;&#x3002;&#x5C1D;&#x8BD5;&#x786E;&#x4FDD;operation&#x5BF9;&#x8C61;&#x6240;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#x7684;&#x5408;&#x7406;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x540C;&#x65F6;&#x521B;&#x5EFA;100&#x4E2A;&#x5B8C;&#x6210;&#x540C;&#x6837;&#x5DE5;&#x4F5C;&#x7684;operation&#x5BF9;&#x8C61;&#xFF0C;&#x5219;&#x4E0D;&#x5982;&#x5206;10&#x6B21;&#xFF0C;&#x6BCF;&#x6B21;&#x540C;&#x65F6;&#x521B;&#x5EFA;10&#x4E2A;&#x8BE5;operation&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x907F;&#x514D;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x4E2D;&#x4E00;&#x6B21;&#x6DFB;&#x52A0;&#x5927;&#x91CF;&#x7684;operation&#x5BF9;&#x8C61;&#xFF0C;&#x907F;&#x514D;&#x6DFB;&#x52A0;operation&#x7684;&#x901F;&#x5EA6;&#x8D85;&#x8FC7;operation&#x672C;&#x8EAB;&#x7684;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4E00;&#x80A1;&#x8111;&#x7684;&#x5C06;&#x6240;&#x6709;operation&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x5230;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#xFF0C;&#x5219;&#x4E0D;&#x5982;&#x6309;&#x6279;&#x6B21;&#x6DFB;&#x52A0;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x6279;&#x6B21;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x5229;&#x7528;completion block&#x6765;&#x544A;&#x8BC9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x521B;&#x5EFA;&#x4E0B;&#x4E00;&#x6279;&#x6B21;&#x3002;&#x6709;&#x5927;&#x91CF;&#x4EFB;&#x52A1;&#x8981;&#x5904;&#x7406;&#x65F6;&#xFF0C;&#x5C3D;&#x91CF;&#x585E;&#x6EE1;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x4F1A;&#x4FDD;&#x8BC1;&#x673A;&#x5668;&#x91CD;&#x590D;&#x8FD0;&#x8F6C;&#xFF0C;&#x4F46;&#x5927;&#x91CF;&#x7684;operation&#x5BF9;&#x8C61;&#x4F1A;&#x9A6C;&#x4E0A;&#x8017;&#x5149;&#x4F60;&#x5F97;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5728;&#x4F7F;&#x7528;operation&#x65F6;&#xFF0C;&#x5C3D;&#x91CF;&#x5728;&#x6548;&#x7387;&#x548C;&#x65F6;&#x95F4;&#x4E4B;&#x95F4;&#x627E;&#x5230;&#x5E73;&#x8861;&#x70B9;&#x3002;</p>
<h3 id="&#x6267;&#x884C;operation">&#x6267;&#x884C;Operation</h3><ol>
<li>&#x5C06;operation&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x5230;&#x64CD;&#x4F5C;&#x961F;&#x5217;  </li>
</ol>
<p>&#x8FD9;&#x662F;&#x6267;&#x884C;operation&#x5BF9;&#x8C61;&#x7684;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x5C5E;&#x4E8E;NSOperatinQueue&#x7C7B;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8D1F;&#x8D23;&#x521B;&#x5EFA;&#x548C;&#x7EF4;&#x62A4;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#xFF0C;Application&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;operation&#x7684;&#x7684;&#x5E76;&#x884C;&#x6267;&#x884C;&#x6570;&#x91CF;&#x662F;&#x6709;&#x9650;&#x5236;&#x7684;&#x3002;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x4F1A;&#x548C;&#x7CFB;&#x7EDF;&#x4E00;&#x8D77;&#x6765;&#x9650;&#x5236;operation&#x7684;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x6570;&#x91CF;&#xFF0C;&#x4EE5;&#x4FDD;&#x6301;&#x5408;&#x7406;&#x7684;&#x7CFB;&#x7EDF;&#x8D1F;&#x8F7D;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x521B;&#x5EFA;&#x989D;&#x5916;&#x7684;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x989D;&#x5916;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<figure class="highlight groovy"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line">NSOperationQueue* aQueue = [[NSOperationQueue alloc] init];</span><br><span class="line"></span><br><span class="line"><span class="comment">// Add a single operation</span></span><br><span class="line">[aQueue <span class="string">addOperation:</span>anOp];</span><br><span class="line"></span><br><span class="line"><span class="comment">// Add multiple operations</span></span><br><span class="line">[aQueue <span class="string">addOperations:</span>anArrayOfOps <span class="string">waitUntilFinished:</span>NO];</span><br><span class="line"></span><br><span class="line"><span class="comment">// Add a block</span></span><br><span class="line">[aQueue <span class="string">addOperationWithBlock:</span>^{</span><br><span class="line">   <span class="comment">/* Do something. */</span></span><br><span class="line">}];</span><br></pre></td></tr></table></figure>
<p>NSOperationQueue&#x8BBE;&#x8BA1;&#x4E0A;&#x662F;&#x7528;&#x6765;&#x5E76;&#x53D1;&#x6267;&#x884C;operation&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F3A;&#x5236;&#x63AA;&#x65BD;&#x6765;&#x4FDD;&#x8BC1;&#x4E00;&#x6B21;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;operation&#x3002;setMaxConcurrentOperationCount:&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x5E76;&#x884C;&#x6267;&#x884C;&#x7684;&#x6700;&#x5927;&#x6570;&#x91CF;&#x3002;&#x8BBE;&#x7F6E;&#x4E3A;1&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x4E00;&#x6B21;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;operation&#xFF0C;&#x4F46;operation&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x5374;&#x4ECD;&#x4F9D;&#x8D56;&#x4E8E;&#x5176;&#x5B83;&#x56E0;&#x7D20;&#xFF0C;&#x5982;operation&#x7684;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#xFF0C;&#x4F18;&#x5148;&#x7EA7;&#x8BBE;&#x7F6E;&#x3002;&#x6240;&#x4EE5;&#x4E32;&#x884C;&#x5316;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x4E0E;&#x4E32;&#x884C;&#x5316;&#x7684;GCD&#x8F6C;&#x53D1;&#x961F;&#x5217;&#x4E0D;&#x540C;&#x3002;&#x9700;&#x8981;&#x8BBE;&#x7F6E;operation&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x6765;&#x4FDD;&#x8BC1;&#x5B83;&#x4EEC;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x662F;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x3002;</p>
<ol>
<li>&#x624B;&#x52A8;&#x6267;&#x884C;Operation</li>
</ol>
<p>&#x53EF;&#x4EE5;&#x5728;&#x6CA1;&#x6709;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x624B;&#x52A8;&#x6267;&#x884C;operation&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x524D;&#x63D0;&#x6761;&#x4EF6;&#x3002;&#x5C24;&#x5176;&#x662F;operation&#x5BF9;&#x8C61;&#x5FC5;&#x987B;&#x51C6;&#x5907;&#x597D;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x4FDD;&#x8BC1;&#x662F;&#x8C03;&#x7528;start&#x65B9;&#x6CD5;&#x6765;&#x6267;&#x884C;&#x3002;</p>
<p>&#x4E00;&#x4E2A;operation&#x53EA;&#x6709;&#x5728;&#x5176;isReady&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;YES&#x65F6;&#x624D;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x53EF;&#x8FD0;&#x884C;&#x7684;&#x3002;isReady&#x65B9;&#x6CD5;&#x4F1A;&#x88AB;&#x6574;&#x5408;&#x8FDB;NSOperation&#x7684;&#x4F9D;&#x8D56;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x6765;&#x4FDD;&#x8BC1;operation&#x7684;&#x4F9D;&#x8D56;&#x72B6;&#x6001;&#x3002;&#x53EA;&#x6709;&#x5728;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x6E05;&#x695A;&#x540E;&#xFF0C;operation&#x624D;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x5728;&#x624B;&#x52A8;&#x6267;&#x884C;operation&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x8C03;&#x7528;&#x5176;start&#x65B9;&#x6CD5;&#x3002;start&#x65B9;&#x6CD5;&#x5728;&#x6B63;&#x5F0F;&#x6267;&#x884C;&#x4F60;&#x5F97;&#x4EE3;&#x7801;&#x4E4B;&#x524D;&#x4F1A;&#x505A;&#x51E0;&#x4E2A;&#x5B89;&#x5168;&#x6027;&#x68C0;&#x6D4B;&#x3002;&#x9ED8;&#x8BA4;&#x7684;start&#x65B9;&#x6CD5;&#x4F1A;&#x751F;&#x6210;operation&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x6240;&#x9700;&#x7684;KVO&#x901A;&#x77E5;&#x3002;&#x540C;&#x65F6;&#x4FDD;&#x8BC1;&#x5DF2;&#x53D6;&#x6D88;&#x7684;operation&#x4E0D;&#x4F1A;&#x518D;&#x6267;&#x884C;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;operation&#x6CA1;&#x5C31;&#x7EEA;&#x5C31;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#x65F6;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;</p>
<h3 id="&#x53D6;&#x6D88;operation">&#x53D6;&#x6D88;Operation</h3><p>&#x4E00;&#x65E6;&#x52A0;&#x5165;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#xFF0C;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x5C31;&#x62E5;&#x6709;&#x4E86;&#x8BE5;operation&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4E0D;&#x80FD;&#x88AB;&#x5220;&#x9664;&#x3002;&#x8C03;&#x51FA;operation&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x662F;&#x53D6;&#x6D88;&#xFF08;cancel&#xFF09;&#x5B83;&#x3002;&#x5728;&#x4E00;&#x4E2A;operation&#x4E0A;&#x8C03;&#x7528;cancel&#x53EF;&#x4EE5;&#x53D6;&#x6D88;&#x5176;&#x6267;&#x884C;&#xFF0C;&#x5728;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x5BF9;&#x8C61;&#x4E0A;&#x8C03;&#x7528;cancelAllOperations &#x4F1A;&#x53D6;&#x6D88;&#x6240;&#x6709;operation&#x3002;</p>
<p>&#x53EA;&#x6709;&#x5728;&#x4F60;&#x786E;&#x77E5;&#x4F60;&#x4E0D;&#x9700;&#x8981;operation&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x4EEC;&#x53D6;&#x6D88;&#x6389;&#x3002;operation&#x7684;&#x53D6;&#x6D88;&#x884C;&#x4E3A;&#x4E5F;&#x4F1A;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#xFF08;finished&#xFF09;&#xFF0C;&#x4F9D;&#x8D56;&#x4E8E;&#x5B83;&#x7684;&#x5176;&#x5B83;operation&#x5BF9;&#x8C61;&#x4F1A;&#x6536;&#x5230;KVO&#x901A;&#x77E5;&#x6765;&#x6E05;&#x9664;&#x8BE5;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x884C;&#x4E3A;&#x662F;&#x54CD;&#x5E94;&#x7279;&#x6B8A;&#x7684;&#x4E8B;&#x4EF6;&#x6765;&#x53D6;&#x6D88;&#x961F;&#x5217;&#x4E2D;&#x6240;&#x6709;&#x7684;operation&#xFF0C;&#x6BD4;&#x5982;&#x7A0B;&#x5E8F;&#x9000;&#x51FA;&#x6216;&#x7528;&#x6237;&#x663E;&#x793A;&#x8FDB;&#x884C;&#x53D6;&#x6D88;&#x3002;</p>
<h3 id="&#x7B49;&#x5F85;operation&#x7ED3;&#x675F;">&#x7B49;&#x5F85;Operation&#x7ED3;&#x675F;</h3><p>&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x6700;&#x4F73;&#x6027;&#x80FD;&#xFF0C;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x8BBE;&#x8BA1;&#x4E3A;&#x5F02;&#x6B65;&#x7684;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;operations&#x6267;&#x884C;&#x65F6;application&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5904;&#x7406;&#x5176;&#x5B83;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x521B;&#x5EFA;operation&#x7684;&#x8FDB;&#x7A0B;&#x9700;&#x8981;&#x5904;&#x7406;operation&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;NSOperation&#x7684; waitUntilFinished&#x65B9;&#x6CD5;&#x6765;&#x963B;&#x585E;&#x4EE3;&#x7801;&#x76F4;&#x5230;operation&#x5B8C;&#x6210;&#x3002;&#x4F46;&#x901A;&#x5E38;&#x5F88;&#x5C11;&#x8FD9;&#x6837;&#x53BB;&#x505A;&#x3002;&#x963B;&#x585E;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x79CD;&#x4FBF;&#x6377;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x5E76;&#x6CA1;&#x6709;&#x5411;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x5E8F;&#x5217;&#x5316;&#x884C;&#x4E3A;&#x6216;&#x9650;&#x5236;&#x5E76;&#x53D1;&#x91CF;&#x3002;</p>
<p><code>&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x51B3;&#x4E0D;&#x80FD;&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E0A;&#x7B49;&#x5F85;&#x4E00;&#x4E2A;operation&#x7ED3;&#x675F;&#x3002;&#x5E94;&#x8BE5;&#x521B;&#x5EFA;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x6765;&#x6267;&#x884C;&#x8BE5;&#x64CD;&#x4F5C;&#x3002;&#x963B;&#x585E;&#x4E3B;&#x7EBF;&#x7A0B;&#x4F1A;&#x5BFC;&#x81F4;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x7684;&#x63A5;&#x53D7;&#x7528;&#x6237;&#x4E8B;&#x4EF6;&#xFF0C;&#x7528;&#x6237;&#x754C;&#x9762;&#x4F1A;&#x6682;&#x65F6;&#x6027;&#x7684;&#x5931;&#x53BB;&#x54CD;&#x5E94;&#xFF0C;&#x8FD9;&#x662F;&#x5728;&#x754C;&#x9762;&#x5F00;&#x53D1;&#x65F6;&#x5E94;&#x6781;&#x529B;&#x907F;&#x514D;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x4EA4;&#x4E92;&#x4F53;&#x9A8C;&#x662F;&#x6781;&#x5DEE;&#x7684;&#x3002;</code></p>
<p>&#x5728;NSOperationQueue&#x4E0A;&#x8C03;&#x7528;waitUntilAllOperationsAreFinished &#x53EF;&#x4EE5;&#x7B49;&#x5F85;&#x961F;&#x5217;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x5B8C;&#x4E4B;&#x540E;&#x5728;&#x8C03;&#x7528;&#x6307;&#x5B9A;&#x7684;&#x56DE;&#x8C03;&#x3002;</p>
<h3 id="&#x6302;&#x8D77;&#x548C;&#x6062;&#x590D;&#x961F;&#x5217;">&#x6302;&#x8D77;&#x548C;&#x6062;&#x590D;&#x961F;&#x5217;</h3><p>&#x8C03;&#x7528;NSOperationQueue&#x5BF9;&#x8C61;&#x7684;setSuspended: &#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x64CD;&#x4F5C;&#x961F;&#x5217;&#x6302;&#x8D77;&#x3002;&#x6302;&#x8D77;&#x961F;&#x5217;&#x4E0D;&#x4F1A;&#x963B;&#x788D;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x6267;&#x884C;&#x4E2D;&#x7684;operation&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x963B;&#x6B62;&#x65B0;&#x7684;operation&#x7684;&#x6267;&#x884C;&#x3002;&#x4E3A;&#x4E86;&#x54CD;&#x5E94;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5173;&#x8D77;&#x4EFB;&#x4F55;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x5904;&#x7406;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x6700;&#x7EC8;&#x91CD;&#x65B0;&#x6062;&#x590D;&#x961F;&#x5217;&#x6267;&#x884C;&#x3002;</p>
<p>More Info <a href="https://developer.apple.com/library/ios/documentation/General/Conceptual/ConcurrencyProgrammingGuide/OperationObjects/OperationObjects.html" target="_blank" rel="external">Operation Queue</a></p>
]]></content>
    <summary type="html">
    <![CDATA[<p><a href="http://my.oschina.net/hmj/blog/135629#OSC_h3_4">博客原文</a></p>
<p>Cocoa operations以面向对象的形式封装程序中的工作单元，提供异步执行机制。Operations可以独立运行，也可以与Operation Queue协同运行。OS X和IOS中Cocoa应用程序大多运用了operation机制。Operations可以提高程序的并发处理能力，可以将应用程序中的某些行为或处理逻辑封装进独立的工作单元，减少应用主线程的的压力，提供流畅的用户界面。</p>
<p>Operation对象是NSOperation类的实例，用以封装执行程序中独立的工作单元。NSOperation类为抽象类，定义并提供了子类所需的关键方法和基础架构，应用程序需要根据实际需求，继承并实现NSOperation类的子类，来处理自己的程序工作单元。为了减少应用程序的类的数量和复杂性，Foundation框架提供了两个NSOperation的具体子类以供使用：</p>]]>
    
    </summary>
    
      <category term="NSOperation" scheme="/tags/NSOperation/"/>
    
      <category term="iOS" scheme="/tags/iOS/"/>
    
      <category term="多线程" scheme="/tags/%E5%A4%9A%E7%BA%BF%E7%A8%8B/"/>
    
  </entry>
  
  <entry>
    <title><![CDATA[Hello World]]></title>
    <link href="/2015/07/01/hello-world/"/>
    <id>/2015/07/01/hello-world/</id>
    <published>2015-07-01T12:17:49.000Z</published>
    <updated>2015-07-01T12:17:49.000Z</updated>
    <content type="html"><![CDATA[<p>Welcome to <a href="http://hexo.io/" target="_blank" rel="external">Hexo</a>! This is your very first post. Check <a href="http://hexo.io/docs/" target="_blank" rel="external">documentation</a> for more info. If you get any problems when using Hexo, you can find the answer in <a href="http://hexo.io/docs/troubleshooting.html" target="_blank" rel="external">troubleshooting</a> or you can ask me on <a href="https://github.com/hexojs/hexo/issues" target="_blank" rel="external">GitHub</a>.</p>
<h2 id="&#x6587;&#x7AE0;&#x76EE;&#x5F55;">&#x6587;&#x7AE0;&#x76EE;&#x5F55;</h2><!-- toc -->
<ul>
<li><a href="#quick-start">Quick Start</a><ul>
<li><a href="#create-a-new-post">Create a new post</a></li>
<li><a href="#run-server">Run server</a></li>
<li><a href="#generate-static-files">Generate static files</a></li>
<li><a href="#deploy-to-remote-sites">Deploy to remote sites</a></li>
</ul>
</li>
</ul>
<!-- tocstop -->
<h2 id="quick-start">Quick Start</h2><h3 id="create-a-new-post">Create a new post</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo new <span class="string">&quot;My New Post&quot;</span></span><br></pre></td></tr></table></figure>
<p>More info: <a href="http://hexo.io/docs/writing.html" target="_blank" rel="external">Writing</a></p>
<h3 id="run-server">Run server</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo server</span><br></pre></td></tr></table></figure>
<p>More info: <a href="http://hexo.io/docs/server.html" target="_blank" rel="external">Server</a></p>
<h3 id="generate-static-files">Generate static files</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo generate</span><br></pre></td></tr></table></figure>
<p>More info: <a href="http://hexo.io/docs/generating.html" target="_blank" rel="external">Generating</a></p>
<h3 id="deploy-to-remote-sites">Deploy to remote sites</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo deploy</span><br></pre></td></tr></table></figure>
<p>More info: <a href="http://hexo.io/docs/deployment.html" target="_blank" rel="external">Deployment</a></p>
]]></content>
    <summary type="html">
    <![CDATA[<p>Welcome to <a href="http://hexo.io/" target="_blank" rel="external">Hexo</a>! This is your very first post. Check <a href="http://hexo.io]]>
    </summary>
    
  </entry>
  
</feed>